{
  "AddCost" : 0,
  "BaseItem" : 74,
  "Charges" : 0,
  "Cost" : 1,
  "Cursed" : 0,
  "DescIdentified" : "THE LANDS OF KHANDURAS\n\nYears after the last Horadrim had died, a great and prosperous society grew in the lands of the West. As time wore on, many Eastern pilgrims settled in the lands surrounding Khanduras and soon established small, self contained kingdoms. A few of these kingdoms bickered with Khanduras over holdings of property or routes of trade. These squabbles did little to upset the lasting peace of the West, and the great Western kingdom of Westmarch proved to be a strong ally of Khanduras as the two lands steadily engaged in ventures of barter and commerce.\n\nDuring this time, a bold, new religion of the Light known as Zakarum began to spread throughout the kingdom of Westmarch and into many of its western principalities. Zakarum, founded in the Far East, implored followers to enter into the Light and forsake the darkness that lurked within their souls. The people of Westmarch adopted the statutes of Zakarum as their sacred mission in the world. Westmarch began to turn towards its neighbors, expecting them to embrace this \"New Beginning\" as well. Tensions rose between the kingdoms of Westmarch and Khanduras as the priests of Zakarum began to preach their foreign dogma whether they were welcomed or not.\n\nIt was then that the great western lord Leoric came unto the lands of Khanduras and, in the name of Zakarum, declared himself King. Leoric was a deeply religious man and had brought many Knights and Priests with him that comprised his Order of the Light. Leoric and his trusted advisor, the Arch Bishop Lazarus, made their way to the town of Tristram. Leoric appropriated the ancient, decrepit Monastery on the outskirts of the town for his seat of power and renovated it to match its time-lost glory. Although the free people of Khanduras were not pleased with being placed under the sudden rule of a foreign King, Leoric served them with justice and might. Eventually, the people of Khanduras grew to respect the kind Leoric, sensing that he sought only to guide and protect them against the oppression of Darkness.",
  "Description" : "",
  "Identified" : 1,
  "LocalizedName" : "The Lands of Khanduras",
  "ModelPart1" : 46,
  "PaletteID" : 60,
  "Plot" : 1,
  "PropertiesList" : [ ],
  "StackSize" : 1,
  "Stolen" : 0,
  "Tag" : "D1_LANDOFKHANDURAS",
  "TemplateResRef" : "landofkhanduras"
}