{
  "AddCost" : 0,
  "BaseItem" : 74,
  "Charges" : 0,
  "Cost" : 1,
  "Cursed" : 0,
  "DescIdentified" : "THE FALL OF THE BLACK KING\n\nThe war against the zealous armies of Westmarch ended with a horrible slaughter. With the army of Khanduras ripped to shreds by the superior numbers and defensive positions of Westmarch, Lachdanan quickly gathered together those who were not captured or killed and ordered a retreat back to the safety of Khanduras. They returned to find the town of Tristram in shambles.\n\nKing Leoric, deep within the throes of madness, went into a rage when he learned that his son was missing. After scouring the village with the few guards that remained with him at the Monastery, Leoric decided that the townsfolk had abducted his son and hidden him somewhere. Although the townspeople denied any knowledge of Prince Albrecht's whereabouts, Leoric insisted that they had crafted a conspiracy against him, and that they would pay the price for such treachery.\n\nThe mysterious disappearance of the Arch-Bishop Lazarus left no one in Tristram with whom the King would take council. Overcome by grief and dementia, Leoric had many of the townsfolk executed for the crime of high treason.\n\nAs Lachdanan and his fellow survivors returned to confront their King, Leoric sent his few remaining guards against them. Believing that Lachdanan was somehow part of the townsfolk's conspiracy, Leoric decreed that he and his party were to die. Lachdanan, finally realizing that Leoric was beyond salvation, ordered his men to defend themselves. The ensuing battle carried them down into the very halls of the darkened Monastery, bringing a final desecration to the once-holy sanctum of the Horadrim. Lachdanan won a bittersweet victory as his men were forced to kill all of Leoric's deceived protectors. They cornered the ravenous King within his own sanctuary and begged him to explain the atrocities he had committed. Leoric only spat at them and cursed them for traitors against both his crown and the Light.\n\nLachdanan walked slowly towards his King and sorrowfully drew his sword. Full of grief and rage, all honor having been cast to the winds, Lachdanan ran his blade through Leoric's shriveled, blackened heart. The once-noble King screamed an unearthly death-cry, and as his madness finally overtook him, he brought down a curse upon those who had so betrayed him. Calling upon the forces of Darkness that he had spent his entire life combating, Leoric condemned Lachdanan and the others to eternal damnation. In that last, fleeting moment within the heart of the Monastery, all that was ever virtuous or honorable about the stewards of Khanduras was shattered forever.",
  "Description" : "",
  "Identified" : 1,
  "LocalizedName" : "The Archbishop's Journal #2",
  "ModelPart1" : 41,
  "PaletteID" : 60,
  "Plot" : 1,
  "PropertiesList" : [ ],
  "StackSize" : 1,
  "Stolen" : 0,
  "Tag" : "D1_LAZARUSJOURNAL2",
  "TemplateResRef" : "lazarusjournal02"
}