{
  "AddCost" : 0,
  "BaseItem" : 74,
  "Charges" : 0,
  "Cost" : 1,
  "Cursed" : 0,
  "DescIdentified" : "THE REIGN OF DIABLO\n\nThe Black King lay dead, slain at the hands of his own Priests and Knights. The young Prince Albrecht was still missing, and the proud defenders of Khanduras were no more. The people of Tristram looked about their lifeless town and were greatly dismayed. Awash in feelings of both relief and remorse, they soon realized that their troubles had merely begun. Strange, eerie lights appeared in the darkened windows of the Monastery. Misshapen, leathery-skinned creatures were seen venturing forth from the shadows of the church. Horrible, wounded cries seemed to linger on the wind, emanating from deep underground. It became apparent that something quite unnatural had infested the once-holy site...\n\nTravelers on the roads surrounding Tristram were accosted by cloaked riders that seemed to now constantly roam the deserted countryside. Many villagers fled Tristram, making their way to other towns and kingdoms, fearing some unnamed evil that seemed to wait in the shadows all around them. Those few who chose to remain seldom ventured out at night, and never tread foot upon the grounds of the cursed Monastery. Whispered rumors of poor, innocent people being abducted in the night by wicked, nightmarish creatures filled the halls of the local inn. With no King, no law, and no army left to defend them, many of the townsfolk began to fear an attack from the things that now dwelt beneath their town.\n\nThe Arch-Bishop Lazarus, frayed and disheveled, returned from his absence and assured the townsfolk that he too had been ravaged by the growing evil of the Monastery. With their desperate need for reassurance clouding their good judgment, Lazarus whipped the townspeople into a frenzied mob. Reminding them that Prince Albrecht was still unaccounted for, he persuaded many of the men to follow him into the depths of the Monastery to search for the boy. They gathered torches and soon the night air glowed with the flickering light of hope. They armed themselves with shovels, picks, and scythes and so prepared, they boldly followed the treacherous Arch-Bishop straight into the fiery maw of Hell itself...\n\nThe few who survived the horrible fate that awaited them returned to Tristram and recounted what they could of the ordeal. Their wounds were terrible, and even the skills of the healer could not save some of them. As the stories of demons and devils spread, a stifling, primal Terror began to consume the hearts of all the town's inhabitants. It was a Terror that none of them had ever known...\n\nDeep beneath the foundations of the ruined Monastery, Diablo gorged himself upon the fears of the mortals above him. He slowly sank back into the welcoming shadows and began to harness his depleted power.\n\nHe smiled to himself in the sheltering darkness, for he knew that the time of his final victory was fast approaching...",
  "Description" : "",
  "Identified" : 1,
  "LocalizedName" : "The Archbishop's Journal #3",
  "ModelPart1" : 41,
  "PaletteID" : 60,
  "Plot" : 1,
  "PropertiesList" : [ ],
  "StackSize" : 1,
  "Stolen" : 0,
  "Tag" : "D1_LAZARUSJOURNAL3",
  "TemplateResRef" : "lazarusjournal03"
}