{
  "AddCost" : 0,
  "BaseItem" : 74,
  "Charges" : 0,
  "Cost" : 1,
  "Cursed" : 0,
  "DescIdentified" : "THE DARKENING OF TRISTRAM\n\nThe absence of prying advisors and inquisitive Priests left Diablo free to assume total control over the King's battered soul. As the Lord of Terror attempted to strengthen his hold upon the maddened King, he found that the lingering spirit of Leoric fought with him still. Although the control over Leoric that Diablo held was formidable, the demon knew that in his weakened state he could never take complete possession of his soul as long as a glimmer of his will remained. The demon lord sought a fresh and innocent host upon which to build his Terror.\n\nThe demon relinquished his control over Leoric, but the King's soul was left corrupted and his mind crazed. Diablo began to search throughout Khanduras for the perfect vessel to act as his focus, and found such a soul easily within his reach. Enjoined by his dark master, Lazarus kidnapped Albrecht - the only son of Leoric - and dragged the terrified youth down into the blackness of the labyrinth. Flooding the boy's defenseless mind with the essence of pure Terror, Diablo easily took possession of the young Albrecht.\n\nPain and fire raced through the child's soul. Hideous laughter filled his head and clouded his thoughts. Paralyzed with fear, Albrecht felt the presence of Diablo within his mind as it seemed to push him down, deeper and deeper into darkness and oblivion. Diablo gazed upon his surroundings through the eyes of the young prince. A lustful hunger still tortured the demon after his frustrating bout for control over Leoric, but the nightmares of the boy provided ample substance to sate him. Reaching deep into Albrecht's subconscious, Diablo ripped the greatest fears of the child from their hiding places and gave them breath.\n\nAlbrecht watched, as if out of a dream, twisted and disfigured forms appeared all around him. Unholy, writhing visages of terror danced about him chanting choruses of obscenities. All of the \"monsters\" that he had ever imagined or believed that he had seen in his life became flesh and were given life before him. Large bodies comprised of living rock erupted from the walls and bowed to their dark master. The ancient, skeletal corpses of the Horadrim arose from archaic crypts and lumbered off into the red-washed corridors beyond. As the cacophony of madness and nightmares hammered its final blow against Albrecht's shattered spirit, the bloodlusted ghouls and demons of his mind scattered and scrambled maniacally into the lengthening passageways of his waking Nightmare.\n\nThe ancient catacombs of the Horadrim had become a twisted labyrinth of raw, focused Terror. Empowered by Diablo's possession of young Albrecht, the creature's of the boy's own imagination had gained corporeal form. So strong was the terror that grew inside of Albrecht, that the borders of the Mortal realm began to warp and tear. The Burning Hell began to seep into the world of Man and take root within the labyrinth. Beings and occurrences displaced by time and space, and long lost to the history of Man were pulled screaming into the ever-expanding domain.\n\nThe body of Albrecht, fully possessed by Diablo, began to distort and change. The small boy grew and his eyes blazed as tendril-like spines ripped through his flesh. Great, arched horns erupted from Albrecht's skull as Diablo altered the form of the child to match that of his demonic body. Deep within the recesses of the labyrinth, a growing power was being harnessed. When the moment was right, Diablo would venture once more into the mortal world and free his captive Brothers Mephisto and Baal. The Prime Evils would be reunited, and together they would reclaim their rightful place in Hell.",
  "Description" : "",
  "Identified" : 1,
  "LocalizedName" : "The Archbishop's Journal #1",
  "ModelPart1" : 41,
  "PaletteID" : 60,
  "Plot" : 1,
  "PropertiesList" : [ ],
  "StackSize" : 1,
  "Stolen" : 0,
  "Tag" : "D1_LAZARUSJOURNAL1",
  "TemplateResRef" : "lazarusjournal01"
}