{
  "AddCost" : 0,
  "BaseItem" : 74,
  "Charges" : 50,
  "Cost" : 226,
  "Cursed" : 1,
  "DescIdentified" : "THE DIABLO CAMPAIGN GUIDE\n\nThis is a short guide and FAQ on how to play this module.\n\nWhere do I go to start levelling if I'm level 1?\n - Check your map for the entrance to the Cathedral.  Enter there and work your way down.\n\nWho do I sell my items to?\n - Talk to Ogden the tavern owner in the town square.\n\nWho identifies items?\n - Talk to Cain the town elder in the middle of the town square.\n\nWho sells healing potions?\n - Talk to Pepin the healer in the town square.\n\nWho sells magic-related stuff?\n - Seek Adria the witch on the northeast part of town (topright).\n\nWho sells monk or rogue stuff?\n - Tremayne the priest sells monk stuff, he is near the Cathedral.  Wirt sells rogue stuff, he is located west of town.\n\nHow do I create a town portal?\n - Buy a book of town portal from Adria the witch, and use its unique power to cast a town portal.\n\nIs there PvP in this module?\n - No, PvP is disabled in this module, since I am not beta testing PvP :)\n\nIs this module downloadable?\n - Not yet.  A single player version of this module (with a huge hakpack) will be available at the Neverwinter Vault after beta testing.\n \nDoes this module have a web site?\n - Yep, you can visit it at http://nwn.tolitz.com/\n \nWhere do I send feedback, suggestions or complaints about this module?\n - You can visit our new message board at http://nwn.tolitz.com/forums, or use the bulletin board located in the second floor of the tavern, or send the mod builder an email at nwn@tolitz.com.",
  "Description" : "",
  "Identified" : 1,
  "LocalizedName" : "The Diablo Campaign Guide",
  "ModelPart1" : 6,
  "PaletteID" : 54,
  "Plot" : 1,
  "PropertiesList" : [
    {
      "ChanceAppear" : 100,
      "CostTable" : 3,
      "CostValue" : 8,
      "Param1" : 255,
      "Param1Value" : 0,
      "PropertyName" : 15,
      "Subtype" : 162
    }
  ],
  "StackSize" : 1,
  "Stolen" : 0,
  "Tag" : "D1_MODULEMANUAL",
  "TemplateResRef" : "modulemanual"
}