{
  "AddCost" : 0,
  "BaseItem" : 74,
  "Charges" : 0,
  "Cost" : 1,
  "Cursed" : 0,
  "DescIdentified" : "THE NATURE OF THE SOULSTONES\n- By Jered Cain of the Horadrim\n\nIt was long ago that the enigmatic Arch-Angel Tyrael bestowed upon us the secrets of the mysterious Soulstones. Tyrael bequested upon our Order three of these Stones so we could contain the vile essences of the Three Prime Evils who had been let loose upon our world. Although the artifacts were constructed in realms far removed from our own, we found that they were simple to understand.\n\nThe Soulstones effect only beings that are non-corporealand thus have no power over living, breathing creatures. When invoked, the Soulstones bring into being a strong \"spiritual\" vacuum. Any non-physical entities caught within this vacuum are drawn into the burning recesses of the Soulstone and are forever trapped within. These spirits are released only when the Soulstone is deactivated or destroyed.\n\nThe power of the Soulstones proved to be much more difficult to employ when used against the great Prime Evils. Voraciously disposed to possessing hapless mortals, the Three Brothers found that they were immune to the effects of the Stones while occupying human souls. Sadly, we were forced to hunt down and kill the innocent victims of the Prime Evils so that their demonic essences could be subject to the effects of the Soulstones.\n\nMephisto and Diablo, once found, were easily lured into the Soulstones. The capture of their brother Baal, however, became complicated when the Soulstone that was to be his eternal prison was shattered and fragmented. We found that while the shards still held the power to lure the demon to them, they could not properly contain it. Tal Rasha, a fellow Initiate who has been since immortalized in Horadrim lore, theorized that a mortal of strong will might be able to contain Baal within his own mortal soul. This sacrifice meant that the essence of any mortal so chosen would be forever tortured while locked in eternal conflict with the enthralled demon.  To this end, Tal Rasha volunteered to contain the raging Lord of Destruction.\n\nPiercing his breast with a shard of the Soulstone, Tal Rasha took within himself the essence of Baal, the Lord of Destruction. The Initiate's body was shackled, chained and buried deep within a tomb under the desert. The sacrifice of Tal Rasha has kept Baal imprisoned for many years now, and although the demon was imprisoned without the use a whole Soulstone, we believe that our victory may be a hollow one. Should Tal Rasha ever escape, he would have the formidable powers of Baal added to his own. By ridding the world of this present Evil, we may have created a nightmare worse than that which we first sought to contain...",
  "Description" : "",
  "Identified" : 1,
  "LocalizedName" : "The Nature of the Soulstones",
  "ModelPart1" : 36,
  "PaletteID" : 60,
  "Plot" : 1,
  "PropertiesList" : [ ],
  "StackSize" : 1,
  "Stolen" : 0,
  "Tag" : "D1_NATUREOFSOULSTONES",
  "TemplateResRef" : "naturesoulstones"
}