{
  "AddCost" : 0,
  "BaseItem" : 74,
  "Charges" : 0,
  "Cost" : 1,
  "Cursed" : 0,
  "DescIdentified" : "THE AWAKENING\n\nNot long after Leoric took possession of Khanduras, a power long asleep awakened within the dark recesses beneath the Monastery. Sensing that freedom was within his grasp, Diablo entered the nightmares of the Arch-Bishop and lured him into the dark, subterranean labyrinth. In his terror, Lazarus raced throughout the abandoned hallways until he at last came to the chamber of the burning Soulstone. No longer in command of his body or spirit, he raised the stone above his head and uttered words long forgotten in the realm of mortals. His will destroyed, Lazarus shattered the Soulstone upon the ground. Diablo once again came into the world of Man. Although he was released from his imprisonment within the Soulstone, the Lord of Terror was still greatly weakened from his long sleep and required an anchor to the world. Once he had found a mortal form to wear, he could begin to reclaim his vastly depleted power. The great demon weighed the souls residing in the town above, and chose to take the strongest of them - that of King Leoric.\n\nFor many months King Leoric secretly fought the evil presence that twisted his thoughts and emotions. Sensing that he had been possessed by some unknown evil, Leoric hid his dark secret from his Priests, hoping that somehow his own devout righteousness would be enough to exorcise the corruption growing inside of him - he was sorely mistaken. Diablo stripped away the core of Leoric's being, burning away all honor and virtue from his soul. Lazarus too, had fallen under the sway of the Demon, keeping close to Leoric at all times. Lazarus worked to conceal the plans of his new Master from the Order of Light, hoping that the demon's power would grow, well concealed amongst the servants of Zakarum.\n\nThe priests of Zakarum and the citizenry of Khanduras recognized the disturbing change within their liege. His once proud and rugged form became distorted and deformed. King Leoric became increasingly deranged and ordered the immediate executions of any who dared to question his methods or authority. Leoric began to send his Knights to other villages to bully their townspeople into submission. The people of Khanduras who had once grown to see great honor in their ruler began to call Leoric the Black King.\n\nDriven to the brink of madness by the Lord of Terror, King Leoric slowly alienated his closest friends and advisors. Lachdanan, Captain of the Knights of the Order of Light and honored Champion of Zakarum, tried to discern the nature of his King's deteriorating spirit. Yet at every turn the Arch-Bishop Lazarus would waylay Lachdanan and admonish him for questioning the actions of the King. As tensions grew between the two, Lazarus charged Lachdanan with treason against the Kingdom. To the Priests and Knights of Leoric's court, the prospect of Lachdanan committing treason was ridiculous. Lachdanan's motives were honorable and just, and soon many began to question the reason of their once-beloved King.\n\nLeoric's madness was growing more obvious with each passing day. Sensing that the advisors of the court were becoming increasingly suspicious of foul treachery, Lazarus desperately sought to contain the eroding situation. The Arch-Bishop masterfully convinced the delusional Leoric that the kingdom of Westmarch was plotting against him, secretly planning to dethrone him and annex Khanduras into its own lands. Leoric flew into a rage and summoned his advisors to his side. Manipulated by the Arch-Bishop, the paranoid King declared a state of war between the kingdoms of Khanduras and Westmarch.\n\nLeoric ignored the warnings and admonishments of his advisors and the royal army of Khanduras was ordered to the West to engage in a war that they did not believe in. Lachdanan was appointed by Lazarus to lead the armies of Khanduras into Westmarch. Although Lachdanan argued against the necessity of the coming conflict, he was honor-bound to uphold the will of his King. Many of the high-priests and officials were forced to travel to the West as emissaries on errands of diplomatic urgency, as well. The desperate ploy of Lazarus had succeeded in sending many of the King's more \"troublesome\" advisors to their certain deaths...",
  "Description" : "",
  "Identified" : 1,
  "LocalizedName" : "The Awakening",
  "ModelPart1" : 1,
  "PaletteID" : 60,
  "Plot" : 1,
  "PropertiesList" : [ ],
  "StackSize" : 1,
  "Stolen" : 0,
  "Tag" : "D1_THEAWAKENING",
  "TemplateResRef" : "theawakening"
}