{
  "AddCost" : 0,
  "BaseItem" : 74,
  "Charges" : 0,
  "Cost" : 1,
  "Cursed" : 0,
  "DescIdentified" : "THE BINDING OF THE THREE\n\nIn the ancient days, before the rise of the Western Empires, the dark and terrible entities known as the Three Evils were exiled to the world of Man.  These eternal entities wandered throughout the waking world and fed upon the lusts of men, leaving chaos and attrition in their wake.  The Evils turned father against son and prompted many great nation into brutal and petty wars.  Their Exile from Hell left them with an insatiable hunger to bring suffering and pain to all who would not kneel before them, and so the Three Brothers ravaged the lands of the Far East for countless centuries.\n \nEventually, a secretive order of mortal magi was gathered together by the enigmatic Arch-Angel Tyrael.  These sorcerers were to hunt the Three Evils and put an end to their vicious rampage.  The order, known as the Horadrim, consisted of wizards from the diverse and numerous mage-clans of the East.  Employing disparate magical practices and disciplines, this unlikely Brotherhood succeeded in capturing two of the Brothers within a powerful artifacts called Soulstones.  Mephisto and Baal, trapped within the swirling, spiritual constraints of the Soulstones, were then buried beneath the dunes of the desolate Eastern Sands.\n \nThe powers of Hatred and wanton Destruction seemed to diminish in the East as a nervous peace began to settle over the land.  Yet, for many decades the Horadrim continued their grim search for the third Brother, Diablo.  They knew that if the Lord of Terror was left untamed there could never be any lasting peace within the realm of humanity.\n \nThe Horadrim followed in the wake of terror and anarchy that spread throughout the Western lands.  After a great battle which claimed the lives of many brave souls, the Lord of Terror was captured and imprisoned within the last of the Soulstones by a group of Horadrim monks led by the Initiate Jered Cain.  These monks carried the cursed stone to the land of Khanduras and buried it within a secluded cave near the river Talsande.  Above this cave the Horadrim constructed a great Monastery from which they could continue to safeguard the Soulstone.  As ages passed, the Horadrim constructed a network of catacombs beneath the Monastery to house the earthly remains of the martyrs of their Order.\n \nGeneration passed in Khanduras, and the numbers of the Horadrim slowly dwindled.  With no quests left to undertake, and too few sons to sustain their guardianship, the once powerful Order faded into obscurity.  Eventually, the great Monastery that they had built fell to ruins as well.  Although villages grew and thrived around the shell of the old Monastery, no one knew of the dark, secret passageways that stretched into the cold earth beneath it.  None could have dreamed of the burning red gem that pulsed within the labyrinth's heart...",
  "Description" : "",
  "Identified" : 1,
  "LocalizedName" : "The Binding of the Three",
  "ModelPart1" : 8,
  "PaletteID" : 60,
  "Plot" : 1,
  "PropertiesList" : [ ],
  "StackSize" : 1,
  "Stolen" : 0,
  "Tag" : "D1_THEBINDINGOFTHETHREE",
  "TemplateResRef" : "thebindingthree"
}