{
  "AddCost" : 0,
  "BaseItem" : 74,
  "Charges" : 0,
  "Cost" : 1,
  "Cursed" : 0,
  "DescIdentified" : "THE DARK EXILE\n\n\"Seven is the number of the powers of Hell, and Seven is the number of the Great Evils.\"\n\nDuriel, the Lord of Pain\nAndariel, the Maiden of Anguish\nBelial, the Lord of Lies\nAzmodan, the Lord of Sin\n\nThese are the true names of the lesser of the Great Evils.  For ages uncounted each have ruled over their own domains within the Burning Hells, seeking absolute dominion over their infernal brethren.  As the Lesser Four continuously vied for the control of those forces that dwelled within their realms, the Greater Three held absolute power over the whole of Hell.  The Lesser Four used dark and evil measures in their quest for power, and herein begins the legend of the Exile.\n\nMephisto, the Lord of Hatred\nBaal, the Lord of Destruction\nDiablo, the Lord of Terror\n\nThese are the Prime Evils of Hell that wielded their power as a dark, sovereign triumvirate.  The Three Brothers ruled over the Lesser Four by brutal force and malicious cunning.  Being the eldest and strongest of the Evils, the Three Brothers were responsible for countless victories against the armies of the Light.  Although they never held sway over the High Heavens for long, the Three were justly feared by enemies and subjects alike.\n\nWith the ascension of Man and the subsequent standstill of the Great Conflict, the Three Brothers began to devote their energies to the perversion of mortal souls.  The Three realized that Man was the key to victory in the war against Heaven, and thus altered their rigid agendum that they had propagated since the Beginning.  This change caused many of the Lesser Evils to question the authority of the Three, and so brought about a great rift between the Prime Evils and their servitors.\n\nIn their ignorance, the  Lesser Evils began to believe that the Three were afraid to continue the war with Heaven.  Frustrated by the cessation of the war, Azmodan and Belial saw the situation as their chance to overthrow the Prime Evils and take control of Hell for themselves.  The two demon lords made a pact with their minor brethren, assuring them that the wretched plague of humanity would not deter the ultimate victory of the sons of Hell.  Azmodan and Belial devised a plan to end the stalemate, achieve victory in the Sin War and ultimately ride the bloody crest of the Great Conflict straight into the very arms of Armageddon.  Thus, a great revolution was set into motion as all of Hell went to war against the Three Brothers...\n\nThe Brothers fought with all of the savagery of the Underworld, and to their credit, annihilated a third of Hell's treacherous legions.   In the end, however, they were overcome by the Horned Death led by the traitors Azmodan and Belial.  The Prime Evils, weakened and bodiless were banished to the mortal realm where Azmodan hoped that they would remain trapped forever.  Azmodan believed that with the Three set loose upon humanity, the Angels would be forced to turn their focus upon on the mortal plane - thus leaving the Gates of Heaven abandoned and defenseless.  Those few demons who still pledged allegiance to the Three Brothers fled the wrath of Azmodan and Belial, escaping to the realm of Man to seek out their lost Masters.\n\nAs the warfires died out upon the battlefields of Hell, Azmodan and Belial began to argue over which of them held the higher authority.  The pact that they had made quickly fell to ashes as the two demon lords took up arms against each other.  The legions of Hell that remained were polarized behind either warlord, launching themselves into a bloody civil war that has lasted to this day...",
  "Description" : "",
  "Identified" : 1,
  "LocalizedName" : "The Dark Exile",
  "ModelPart1" : 107,
  "PaletteID" : 60,
  "Plot" : 1,
  "PropertiesList" : [ ],
  "StackSize" : 1,
  "Stolen" : 0,
  "Tag" : "D1_THEDARKEXILE",
  "TemplateResRef" : "thedarkexile"
}