{
  "AddCost" : 0,
  "BaseItem" : 74,
  "Charges" : 0,
  "Cost" : 1,
  "Cursed" : 0,
  "DescIdentified" : "THE GREAT CONFLICT\n\nSince the beginning, the forces of Light and Darkness have engaged in an eternal war: the Great Conflict, whose victor will rise from the apocalyptic ashes to hold sway over all creation.  To this end, the Angels of the High Heavens adhere to strict militaristic disciplines.  Seraphim warriors strike at the enemies of Light with swords imbued with righteous wrath and justice.  The Angels believe that only absolute discipline can properly restore order to the myriad realms, while the demonic denizens of the Burning Hells hold that absolute chaos is the true nature of all things.\n\nThe battles of the Great Conflict rage across both time and space, often infringing upon the very fabric of reality itself.  From the Crystal Arch at the very heart of the High Heavens to the arcane Hellforge of the Underworld, the warriors of these eternal realms journey to wherever their timeless conflict carries them.  The legendary deeds of the heroes of the realms beyond elicit both veneration and insight.\n\nThe greatest of these heroes was Izual, lieutenant to the Arch-Angel Tyrael and bearer of the Angelic Runeblade Azurewrath.  He once led a fierce attack on the Hellforge as the creation of the dark demonblade Shadowfang was nearing completion.  His quest was to destroy both wielder and weapon - a charge that he was destined never to complete.  Izual was overcome by the legions of chaos and, tragically, was lost to the Darkness.  His fate stands as testament to the fact that Angels and Demons alike shall fearlessly enter into any domain - so long as their hated enemies dwell within.\n\nAlthough the Great Conflict burned hotter and longer than any of the stars in the sky, neither side could gain dominion over the other for long.  Both factions sought some way to turn the tides of the war to their favor.  With the ascension of Man and his mortal realm, the Great Conflict ground to a mysterious halt.  Both armies paused in a breathless stalemate, waiting to see to whose side Man would eventually turn.\n\nMortals had the unique ability to choose between Darkness and Light, and it was held that this would be the deciding factor in the outcome of the Great Conflict.  Thus, the agents of the nether-realms descended to the mortal realm to vie for the favor of Man...",
  "Description" : "",
  "Identified" : 1,
  "LocalizedName" : "The Great Conflict",
  "ModelPart1" : 87,
  "PaletteID" : 60,
  "Plot" : 1,
  "PropertiesList" : [ ],
  "StackSize" : 1,
  "Stolen" : 0,
  "Tag" : "D1_THEGREATCONFLICT",
  "TemplateResRef" : "thegreatconflict"
}