{
  "AddCost" : 0,
  "BaseItem" : 74,
  "Charges" : 0,
  "Cost" : 1,
  "Cursed" : 0,
  "DescIdentified" : "THE SIN WAR\n\nThe coming of the Great Conflict to the mortal realm is known as the Sin War.  Angels and Demons, disguising themselves while traveling amongst men, attempted to secretly lure mortals to their respective causes.  Over time, the forces of Darkness discovered that mortals responded much more to brute force than to subtle coercion, and so began to terrorize Man into submission.  The Angels fought to defend humanity against this demonic oppression, but all too often their austere methods and severe punishments succeeded only in alienating those whom they sought to protect.\n   \nThe violent battles of the Sin War occurred often, but they were seldom witnessed by the prying eyes of Man.  Only a few \"enlightened\" souls were aware of the supernatural beings that walked amongst the huddled masses of humanity.  Powerful mortals arose and accepted the challenge of the Sin War, allying themselves with both sides in the Great Conflict.  The legendary deeds of these great mortal warriors served to earn both the respect and hatred of the Netherworld.  Although lesser demons kneeled before those possessing power and strength, they also cursed the very existence of mortal man.  Many of these fiends believed that the deadlock brought about by the emergence of Man was a perverse offense to their \"higher\" role in the great scheme of things.\n\nThis jealousy of Man led to harsh, atrocious acts of violence by the demons against the mortal realm.  Some men learned of this deep hatred and used it against the denizens of the Underworld.  One such mortal, Horazon the Summoner, delighted in summoning demons and then breaking them to his will.  Horazon, along with his brother Bartuc, were members of the Eastern mage clan known as the Vizjerei.  This mystic clan studied the ways of demons and had catalogued their lore for generations.  Empowered by this knowledge, Horazon was able to take the work of the Vizjerei and pervert it for his demented purposes.  The denizens of Hell sought revenge against this bold mortal,but Horazon managed to keep himself well protected within his arcane sanctuary.\n\nBartuc, the brother of Horazon, was eventually lured to the side of Darkness.  He was granted exceptional strength and longevity, and fought alongside the legions of Hell against the cursed Vizjerei, and eventually his own brother during the Sin War.  Although Bartuc was renowned  amongst the warriors of many realms, his dominance in battle came with a terrible price.\n\nAn insatiable lust for mortal blood pervaded his every thought and deed.  Bartuc soon became as fond of bathing in the blood of his enemies as he did of shedding it, and in time he came to be known only as the Warlord of Blood.",
  "Description" : "",
  "Identified" : 1,
  "LocalizedName" : "The Sin War",
  "ModelPart1" : 106,
  "PaletteID" : 60,
  "Plot" : 1,
  "PropertiesList" : [ ],
  "StackSize" : 1,
  "Stolen" : 0,
  "Tag" : "D1_THESINWAR",
  "TemplateResRef" : "thesinwar"
}