{
  "DelayEntry" : 0,
  "DelayReply" : 0,
  "EndConverAbort" : "nw_walk_wp",
  "EndConversation" : "nw_walk_wp",
  "EntryList" : [
    {
      "AnimLoop" : 1,
      "Animation" : 0,
      "Delay" : 4294967295,
      "RepliesList" : [
        1,
        0
      ],
      "Text" : "I'm leaving in a few moments.  Did you need anything else?"
    },
    {
      "AnimLoop" : 1,
      "Animation" : 0,
      "Delay" : 4294967295,
      "RepliesList" : [
        9,
        8,
        7,
        6,
        5,
        4,
        3,
        2
      ],
      "Script" : "end_virginx_loca",
      "Text" : "I'll be delighted to answer them, but make it quick - my ox is getting a little antsy..."
    },
    {
      "AnimLoop" : 1,
      "Animation" : 0,
      "Delay" : 4294967295,
      "RepliesList" : [
        {
          "Index" : 11,
          "IsChild" : true
        },
        {
          "Index" : 10,
          "IsChild" : true
        }
      ],
      "Text" : "Well, I know that Ogden the tavern owner has been the one greeting many of the adventurers who have been coming into town, since most of them seem to head straight into his establishment as soon as they arrive, so you might want to talk to him first.  Cain the storyteller is also quite a wordy chap, so if you're in need of conversation, he won't run out of tales for you."
    },
    {
      "AnimLoop" : 1,
      "Animation" : 0,
      "Delay" : 4294967295,
      "RepliesList" : [
        {
          "Index" : 11,
          "IsChild" : true
        },
        {
          "Index" : 10,
          "IsChild" : true
        }
      ],
      "Text" : "That would be Cain the storyteller.  He seems to know a lot of things - even things I won't even dream of asking, so he may be able to help you with that."
    },
    {
      "AnimLoop" : 1,
      "Animation" : 0,
      "Delay" : 4294967295,
      "RepliesList" : [
        {
          "Index" : 11,
          "IsChild" : true
        },
        {
          "Index" : 10,
          "IsChild" : true
        }
      ],
      "Text" : "Why, yes...  if you find any caped mercenaries in Tristram, they're only there to make sure nothing unpleasant finds its way into Tristram.  As far as I know, you can rest in the middle of the stream if you want, haha!  I don't really know if you can rest anywhere in the labyrinth, and I don't know why you would rest in such a dark place, anyway.  Beyond that, I cannot really tell you."
    },
    {
      "AnimLoop" : 1,
      "Animation" : 0,
      "Delay" : 4294967295,
      "RepliesList" : [
        {
          "Index" : 11,
          "IsChild" : true
        },
        {
          "Index" : 10,
          "IsChild" : true
        }
      ],
      "Text" : "You can sell to the merchants who are in town.  Not all of them will buy anything you try to sell them, except for Ogden, the owner of the Tavern of the Rising Sun, who will probably buy anything you sell him.  He is probably trading those items to those adventurers to earn a little extra for his dwindling business."
    },
    {
      "AnimLoop" : 1,
      "Animation" : 0,
      "Delay" : 4294967295,
      "RepliesList" : [
        {
          "Index" : 11,
          "IsChild" : true
        },
        {
          "Index" : 10,
          "IsChild" : true
        }
      ],
      "Text" : "Magical devices have not really been common items of interest in Tristram, but since that witch Adria came to town, she has been selling some peculiar magical devices and spell scrolls to the adventurers who are pouring into town.  You should try out those town portal things she sells - I heard it's a very popular purchase among the adventurers..."
    },
    {
      "AnimLoop" : 1,
      "Animation" : 0,
      "Delay" : 4294967295,
      "RepliesList" : [
        {
          "Index" : 11,
          "IsChild" : true
        },
        {
          "Index" : 10,
          "IsChild" : true
        }
      ],
      "Text" : "Pepin the healer still sells his potions and healing kits to anyone who can afford them.  Tremayne the priest has brought some enhancement potions with him when he came back to town.  And then there's that strange witch north of town... Her name is Adria, and she also sells some potions.  I don't know how much better they are than what the priest sells, though."
    },
    {
      "AnimLoop" : 1,
      "Animation" : 0,
      "Delay" : 4294967295,
      "RepliesList" : [
        11,
        10
      ],
      "Text" : "Griswold the Blacksmith is the person to look for if you want the very best weapons and armor in the whole of Khanduras.  I think the priest Tremayne is back again in town to sell some holy items and some stuff for monks, if you know some.  The boy Wirt has recently started selling some really strange items - some said to be more interesting than what Griswold sells.  Be careful when you talk to that kid, though... He's been different since his little... experience."
    },
    {
      "AnimLoop" : 1,
      "Animation" : 29,
      "Delay" : 4294967295,
      "RepliesList" : [
        16,
        12
      ],
      "Script" : "end_old_acquaint",
      "Text" : "Wait, I know you!  You once lived here didn't you?"
    },
    {
      "AnimLoop" : 1,
      "Animation" : 0,
      "Delay" : 4294967295,
      "RepliesList" : [
        15,
        13
      ],
      "Text" : "Hmm, that can't be.  I don't forget a face.  Oh yes, you're <FirstName>!"
    },
    {
      "AnimLoop" : 1,
      "Animation" : 0,
      "Delay" : 4294967295,
      "RepliesList" : [
        14
      ],
      "Text" : "Oh come now, don't be a stranger <FirstName>.  I have known you since you were a toddler."
    },
    {
      "AnimLoop" : 1,
      "Animation" : 0,
      "Delay" : 4294967295,
      "RepliesList" : [
        17,
        {
          "Index" : 21,
          "IsChild" : true
        }
      ],
      "Text" : "Hmm, well, everyone else is leaving Tristram!  There have been so many bad things happening nowadays that most of the townspeople have fled from the village."
    },
    {
      "AnimLoop" : 1,
      "Animation" : 0,
      "Delay" : 4294967295,
      "RepliesList" : [
        18
      ],
      "Text" : "All sorts of grisly stuff.  People being killed off by cloaked riders in the north - and some other creatures I can't even begin to describe.  And some time ago, we lost many of our good men in the cathedral. Such a tragic thing that was..."
    },
    {
      "AnimLoop" : 1,
      "Animation" : 0,
      "Delay" : 4294967295,
      "RepliesList" : [
        19
      ],
      "Text" : "Oh, I see you have been gone too long...  Well, I'm sure you probably heard of King Leoric's son who disappeared, and the king's advisor, Archbishop Lazarus, leading a group of able-bodied men to find the prince below the church, where he says the King's son might be."
    },
    {
      "AnimLoop" : 1,
      "Animation" : 0,
      "Delay" : 4294967295,
      "RepliesList" : [
        37,
        21,
        20
      ],
      "Text" : "Only a handful of men came back from there - all critically wounded, some dying.  My friend Farnham was one of the men who came back, and his sanity has not been the same since then.  He refuses to talk about what happened back there, especially about the Archbishop Lazarus - rumors had it that the archbishop either died in the labyrinth, or that he betrayed the town of Tristram and led those men to their deaths!"
    },
    {
      "AnimLoop" : 1,
      "Animation" : 0,
      "Delay" : 4294967295,
      "RepliesList" : [
        {
          "Index" : 37,
          "IsChild" : true
        },
        {
          "Index" : 21,
          "IsChild" : true
        },
        {
          "Index" : 22,
          "IsChild" : true
        }
      ],
      "Text" : "King Leoric is dead.  He has gone mad at the loss of his son and has ordered the death of many innocent people.  The royal court had to depose him in the worst possible way...  These lands have really suffered hard times, indeed."
    },
    {
      "AnimLoop" : 1,
      "Animation" : 0,
      "Delay" : 4294967295,
      "RepliesList" : [
        22,
        {
          "Index" : 17,
          "IsChild" : true
        }
      ],
      "Text" : "There are a handful of our people left there, I don't know if they would still be willing to stay after all this trouble that has happened in our town."
    },
    {
      "AnimLoop" : 1,
      "Animation" : 0,
      "Delay" : 4294967295,
      "RepliesList" : [
        24,
        {
          "Active" : "prq_handout",
          "Index" : 23,
          "IsChild" : false
        }
      ],
      "Text" : "Actually, I am just giving away most of my belongings to lighten the load on my wagon before I head East!  Since there seems to be quite a few adventurers coming to Tristram all of a sudden, I saw it as an opportunity to be generous!"
    },
    {
      "AnimLoop" : 1,
      "Animation" : 0,
      "Delay" : 4294967295,
      "RepliesList" : [
        25
      ],
      "Text" : "I remember having already given you some stuff <FirstName>, sorry."
    },
    {
      "AnimLoop" : 1,
      "Animation" : 0,
      "Delay" : 4294967295,
      "RepliesList" : [
        29,
        28,
        26
      ],
      "Text" : "Haha, that's the idea.  I am actually almost out of things I can give, with that last adventurer who passed by here being so demanding and all...  I can give you what I have left - apart from my own personal belongings of course.  Do you want them, <FirstName>?"
    },
    {
      "AnimLoop" : 1,
      "Animation" : 0,
      "Delay" : 4294967295,
      "RepliesList" : [
        {
          "Index" : 29,
          "IsChild" : true
        },
        27
      ],
      "Text" : "Bah, I would not give away things without setting aside something sizeable for myself.  Are you sure you don't want it?"
    },
    {
      "AnimLoop" : 1,
      "Animation" : 0,
      "Delay" : 4294967295,
      "RepliesList" : [
        {
          "Index" : 31,
          "IsChild" : true
        }
      ],
      "Script" : "trg_startx",
      "Text" : "Very well, then. I would have to be leaving in a moment.  Is there anything else I can help you with?"
    },
    {
      "AnimLoop" : 1,
      "Animation" : 0,
      "Delay" : 4294967295,
      "RepliesList" : [
        31,
        30
      ],
      "Script" : "trg_start",
      "Text" : "Well then, here you go.  I would have to be leaving in a moment.  Is there anything else I can help you with?"
    },
    {
      "AnimLoop" : 1,
      "Animation" : 0,
      "Delay" : 4294967295,
      "RepliesList" : [
        36,
        34,
        32
      ],
      "Text" : "I might.  Maybe I'll do a stop-over here and there... probably spend a night or two at Luth Golein before I take that ship over the Twin Seas.  Anyway, I am sure any place is better than here."
    },
    {
      "AnimLoop" : 1,
      "Animation" : 0,
      "Delay" : 4294967295,
      "RepliesList" : [
        33
      ],
      "Script" : "end_virginx_loca",
      "Text" : "Whatever, my friend.  Just keep a look out for anything that goes bump in the darkness over there.  If you need to ask me more questions, just do so before you go to Tristram.  I'll be leaving in a few moments. May the light guide you, and farewell."
    },
    {
      "AnimLoop" : 1,
      "Animation" : 0,
      "Delay" : 4294967295,
      "RepliesList" : [
        35
      ],
      "Script" : "end_virginx_loca",
      "Text" : "May the light guide you as well.  Just keep a look out for anything that goes bump in the darkness over there.  If you need to ask me more questions, just do so before you go to Tristram.  I'll be leaving in a few moments.  Goodbye."
    },
    {
      "AnimLoop" : 1,
      "Animation" : 0,
      "Delay" : 4294967295,
      "RepliesList" : [
        40,
        39,
        38
      ],
      "Text" : "NO!  Please, don't ask Farnham about that day!  He cried and wailed the last time we asked him about it.  It would be better if you don't mention the Archbishop to him, for the sake of his own sanity...."
    },
    {
      "AnimLoop" : 1,
      "Animation" : 0,
      "Delay" : 4294967295,
      "RepliesList" : [
        41
      ],
      "Script" : "trg_startmodule2",
      "Text" : "Hey, you're back <FirstName>!  Forgot anything?  Well, never mind."
    },
    {
      "AnimLoop" : 1,
      "Animation" : 0,
      "Delay" : 4294967295,
      "RepliesList" : [
        42
      ],
      "Text" : "Hey, you're back <FirstName>!  Forgot anything?  Well, never mind."
    },
    {
      "AnimLoop" : 1,
      "Animation" : 0,
      "Delay" : 4294967295,
      "RepliesList" : [
        43
      ],
      "Script" : "trg_startmodulex",
      "Text" : "I notice there's a mysterious portal over there that appeared right after you arrived.  Perhaps you should investigate it!"
    }
  ],
  "NumWords" : 1555,
  "PreventZoomIn" : 0,
  "ReplyList" : [
    {
      "Text" : "I think I am ready.  Goodbye."
    },
    {
      "EntriesList" : [
        1
      ],
      "Text" : "I would like to ask you a few questions."
    },
    {
      "Text" : "Never mind, I think I am ready."
    },
    {
      "EntriesList" : [
        2
      ],
      "Text" : "Is there anyone in Tristram who can tell me some more details about what is going on there?"
    },
    {
      "EntriesList" : [
        3
      ],
      "Text" : "Who identifies items in town?"
    },
    {
      "EntriesList" : [
        4
      ],
      "Text" : "Can I rest anywhere in town?"
    },
    {
      "EntriesList" : [
        5
      ],
      "Text" : "Can I sell my things to everybody there?"
    },
    {
      "EntriesList" : [
        6
      ],
      "Text" : "Who sells scrolls and other magic devices in town?"
    },
    {
      "EntriesList" : [
        7
      ],
      "Text" : "Who sells potions and healing kits in town?"
    },
    {
      "EntriesList" : [
        8
      ],
      "Text" : "Who sells weapons and armor in town?"
    },
    {
      "Text" : "That's all I need to know.  Goodbye."
    },
    {
      "EntriesList" : [
        {
          "Index" : 1,
          "IsChild" : true
        }
      ],
      "Text" : "I have other questions for you."
    },
    {
      "EntriesList" : [
        10
      ],
      "Script" : "con_chaotic1",
      "Text" : "<StartAction>Lie.</Start> No, I am new to this place."
    },
    {
      "EntriesList" : [
        11
      ],
      "Script" : "con_chaotic1",
      "Text" : "<StartAction>Lie.</Start> I don't know this <FirstName> you're speaking of."
    },
    {
      "EntriesList" : [
        {
          "Index" : 12,
          "IsChild" : true
        }
      ],
      "Text" : "Whatever.  What are you doing here?"
    },
    {
      "EntriesList" : [
        {
          "Index" : 12,
          "IsChild" : true
        }
      ],
      "Text" : "Yes, that's my name.  What are you doing here?"
    },
    {
      "EntriesList" : [
        12
      ],
      "Text" : "I guess I did.  It's been a long time. My name is <FirstName>.  What are you doing here?"
    },
    {
      "EntriesList" : [
        13
      ],
      "Text" : "What things have been happening?"
    },
    {
      "EntriesList" : [
        14
      ],
      "Text" : "The cathedral?  What happened there?"
    },
    {
      "EntriesList" : [
        15
      ],
      "Text" : "Then what happened?"
    },
    {
      "EntriesList" : [
        16
      ],
      "Text" : "What did the King say?"
    },
    {
      "EntriesList" : [
        17
      ],
      "Text" : "Is there anyone still left in town, then?"
    },
    {
      "EntriesList" : [
        18
      ],
      "Text" : "Then why are you still here?"
    },
    {
      "EntriesList" : [
        {
          "Index" : 21,
          "IsChild" : true
        }
      ],
      "Text" : "Well, I don't think I need anything right now, anyway . You probably need it more than I, with your long journey and all."
    },
    {
      "EntriesList" : [
        {
          "Active" : "prq_handout",
          "Index" : 20,
          "IsChild" : false
        },
        19
      ],
      "Text" : "Well, what do you have?  Maybe I can help you \"lessen\" your load?"
    },
    {
      "Text" : "Alright, goodbye."
    },
    {
      "EntriesList" : [
        21
      ],
      "Text" : "I don't need anything right now.  You probably need it more than I, with your long journey and all."
    },
    {
      "EntriesList" : [
        22
      ],
      "Script" : "end_virgin_local",
      "Text" : "I'm fine."
    },
    {
      "EntriesList" : [
        {
          "Index" : 23,
          "IsChild" : true
        }
      ],
      "Script" : "con_chaotic1",
      "Text" : "Sure, give me a dole-out.  In fact, I demand it!"
    },
    {
      "EntriesList" : [
        23
      ],
      "Text" : "Sure, I'll appreciate what you can give me."
    },
    {
      "EntriesList" : [
        {
          "Index" : 24,
          "IsChild" : true
        }
      ],
      "Script" : "end_virgin_local",
      "Text" : "I think you have done enough.  Why don't you stop by Luth Golein and avail yourself of some courtesan company before you sail?"
    },
    {
      "EntriesList" : [
        24
      ],
      "Script" : "end_virgin_local",
      "Text" : "I think I can manage now.  I wish you luck on your trip.  Are you heading straight East from here?"
    },
    {
      "EntriesList" : [
        25
      ],
      "Script" : "con_evil1",
      "Text" : "I'll decide that for myself, I'm no coward, and I can face whatever comes my way.  You go and run."
    },
    {
      "Text" : ""
    },
    {
      "EntriesList" : [
        26
      ],
      "Script" : "con_good1",
      "Text" : "Well, I guess this is farewell.  May the light guide you."
    },
    {
      "Text" : ""
    },
    {
      "EntriesList" : [
        {
          "Index" : 1,
          "IsChild" : true
        }
      ],
      "Text" : "Before you leave, maybe you can answer some questions for me?"
    },
    {
      "EntriesList" : [
        27
      ],
      "Text" : "Maybe I should ask Farnham more about what happened in the church."
    },
    {
      "EntriesList" : [
        {
          "Index" : 16,
          "IsChild" : true
        }
      ],
      "Text" : "Did the king do anything about these events?"
    },
    {
      "EntriesList" : [
        {
          "Index" : 17,
          "IsChild" : true
        }
      ],
      "Text" : "I'll remember that ... Is there anyone else left in town?"
    },
    {
      "EntriesList" : [
        {
          "Index" : 17,
          "IsChild" : true
        }
      ],
      "Script" : "con_evil1",
      "Text" : "Nonsense!  It'll be fun to see him crack.  So did scurry away like rats after that incident?"
    },
    {
      "Text" : ""
    },
    {
      "EntriesList" : [
        30
      ],
      "Text" : ""
    },
    {
      "Text" : ""
    }
  ],
  "StartingList" : [
    {
      "Active" : "prq_cornerstonex",
      "Index" : 29
    },
    {
      "Active" : "prq_soulstonex",
      "Index" : 28
    },
    {
      "Active" : "prq_virgin_local",
      "Index" : 9
    },
    0
  ]
}