{
  "Categories" : [
    {
      "Comment" : "",
      "EntryList" : [
        {
          "End" : 0,
          "ID" : 1,
          "Text" : "Adria asked you to acquire two 'baubles' from Wirt, and in return she will give you a Loot Genie"
        },
        {
          "End" : 1,
          "ID" : 2,
          "Text" : "Adria has given you a Loot Genie in exchange for two 'baubles' from Wirt."
        },
        {
          "End" : 1,
          "ID" : 3,
          "Text" : "On grounds of pure self respect, you have declined to be Adria's errand <boy/girl>, and will not be retrieving the baubles from Wirt."
        }
      ],
      "Name" : "Loot Genie",
      "Picture" : 65535,
      "Priority" : 3,
      "Tag" : "QST_LOOT_GENIE",
      "XP" : 0
    },
    {
      "EntryList" : [
        {
          "End" : 1,
          "ID" : 1,
          "Text" : "While haggling with a merchant you rolled a perfect 10 and the merchant rolled a 1."
        }
      ],
      "Name" : "ACHIEVEMENT: Dude Perfect",
      "Picture" : 65535,
      "Priority" : 3,
      "Tag" : "ACH_DUDE_PERFECT",
      "XP" : 0
    },
    {
      "EntryList" : [
        {
          "End" : 1,
          "ID" : 1,
          "Text" : "While haggling with a merchant you rolled a 1 and the merchant rolled a perfect 10."
        }
      ],
      "Name" : "ACHIEVEMENT: Raw Deal",
      "Picture" : 65535,
      "Priority" : 3,
      "Tag" : "ACH_RAW_DEAL",
      "XP" : 0
    },
    {
      "Comment" : "",
      "EntryList" : [
        {
          "End" : 1,
          "ID" : 1,
          "Text" : "TheeMon remembered you and was kind enough to outfit you with some 'welcome back' gear!"
        },
        {
          "End" : 1,
          "ID" : 2,
          "Text" : "You declined to accept TheeMon's 'welcome back' gear!"
        }
      ],
      "Name" : "Welcome Back!",
      "Picture" : 65535,
      "Priority" : 3,
      "Tag" : "QST_WELCOME_BACK",
      "XP" : 0
    },
    {
      "Name" : "Should old acquaintance be forgot...",
      "Picture" : 65535,
      "Priority" : 3,
      "Tag" : "QST_OLD_ACQUAINTANCE",
      "XP" : 0,
      "Comment" : "",
      "EntryList" : [
        {
          "End" : 0,
          "ID" : 1,
          "Text" : "It has been a bittersweet homecoming in light of the dire circumstances.<CUSTOM30000>"
        },
        {
          "End" : 1,
          "ID" : 2,
          "Text" : "It has been a bittersweet homecoming in light of the dire circumstances.  I reacquainted myself with all the town members."
        }
      ]
    },
    {
      "Comment" : "",
      "EntryList" : [
        {
          "End" : 0,
          "ID" : 1,
          "Text" : "You received a really weird message from a bush north of town.  It said that there were weapons to be found in a rock south of Tristram... Perhaps it's something worth investigating - it might give you something to use!"
        },
        {
          "End" : 1,
          "ID" : 2,
          "Text" : "You have found no weapons hidden in a rock, or any other place in town.  The bush insists there are weapons, but your patience has run out.  You tell it to shut up and curiously, it did, but not before taking the bottle of oil you just found...\n\nHence, you conclude that there are no weapons in a rock, no matter what the bush says... it just wanted the oil..."
        }
      ],
      "Name" : "A Bush, a Weapon, and a Rock",
      "Picture" : 65535,
      "Priority" : 3,
      "Tag" : "QST_IRAQ",
      "XP" : 0
    },
    {
      "Comment" : "",
      "EntryList" : [
        {
          "End" : 0,
          "ID" : 1,
          "Text" : "A quest given to you by Chuck.  You don't really know what it is."
        },
        {
          "End" : 1,
          "ID" : 2,
          "Text" : "The quest given to you by Chuck has been completed.  You don't really know how or why."
        }
      ],
      "Name" : "A Quest",
      "Picture" : 65535,
      "Priority" : 2,
      "Tag" : "QST_QUEST1",
      "XP" : 0
    },
    {
      "Comment" : "",
      "EntryList" : [
        {
          "End" : 0,
          "ID" : 1,
          "Text" : "A special quest has been given to you by Chuck.   As always, you don't know what it is you're supposed to do."
        },
        {
          "End" : 1,
          "ID" : 2,
          "Text" : "The special quest has been completed by Chuck because he likes the sound of quests being completed."
        }
      ],
      "Name" : "A Special Quest",
      "Picture" : 65535,
      "Priority" : 2,
      "Tag" : "QST_QUEST3",
      "XP" : 0
    },
    {
      "Comment" : "",
      "EntryList" : [
        {
          "End" : 0,
          "ID" : 1,
          "Text" : "An investigation into the whereabouts of the missing men of Tristram elicited a name - Andariel.  It sounds like this Andariel may be the cause of all the disappearing men in Tristram, as well as the scattered corpses you have seen in the forest caverns.\n\nMaybe Cain can shed some light on who this Andariel is."
        },
        {
          "End" : 0,
          "ID" : 2,
          "Text" : "Cain the storyteller mentions that Andariel was a demonic temptress that feasts on the essence of mortal men.  A vile creature indeed, you must try to find the whereabouts of her lair and stop her from continuing her demonic lust for human males.  Maybe the best place to start would be where you discovered about her - the forest, and what lies beyond."
        },
        {
          "End" : 1,
          "ID" : 3,
          "Text" : "You have vanquished Andariel, but it is not clear if you have truly destroyed her for good.  Her dying breath spoke of a promise to meet you again.  Perhaps this is not the last you have seen of the Maiden of Anguish.\n\nThe bodies of dead men litter her inner sanctum, reminding you of the grisly fate of Deese's sons, but Tristram can now rest assured that the havoc wrought by Andariel's hunger has ended, and the wilderness of Khanduras have been rid of its evil... for now..."
        }
      ],
      "Name" : "Andariel",
      "Picture" : 65535,
      "Priority" : 2,
      "Tag" : "QST_ANDARIEL",
      "XP" : 0
    },
    {
      "Comment" : "",
      "EntryList" : [
        {
          "End" : 0,
          "ID" : 1,
          "Text" : "Tremayne has asked me to locate a fellow priest named Remy.  Remy was last seen in the rectory before the church was overrun."
        },
        {
          "End" : 0,
          "ID" : 2,
          "Text" : "Tremayne has asked me to locate a fellow priest named Remy.  Remy was last seen in the rectory before the church was overrun.\n\nI have located Remy, he is safe studying in the rectory library.  I will let Tremayne know."
        },
        {
          "End" : 1,
          "ID" : 3,
          "Text" : "Tremayne has asked me to locate a fellow priest named Remy.  Remy was last seen in the rectory before the church was overrun.\n\nI have located Remy, he is safe studying in the rectory library.  I will let Tremayne know.\n\nTremayne was relieved to hear Remy is fine."
        }
      ],
      "Name" : "Find Remy",
      "Picture" : 65535,
      "Priority" : 4,
      "Tag" : "QST_FIND_REMY",
      "XP" : 250
    },
    {
      "Comment" : "",
      "EntryList" : [
        {
          "End" : 0,
          "ID" : 1,
          "Text" : "The priest Tremayne mentions an exorcism that he did in town, where he drove out a demon from a man's body.  The demon has named himself Fleshdoom, and has been seen fleeing into the labyrinth.\n\nThe man who was possessed retained his memory and mentioned a cursed demon blade called Shadowfang.  It seems to be the sword that the demon Fleshdoom wields.  Tremayne has warned you against wielding the sword if you acquire it, for it is said to corrupt and madden any mortal who wields it.\n\nTremayne asks that you destroy this vile demon and retrieve the cursed demon blade, so that priest may destroy it and end its evil."
        },
        {
          "End" : 0,
          "ID" : 2,
          "Text" : "You have caught sight of Fleshdoom in the labyrinth, but he has fled before you had the chance to face him.  Perhaps you can find him again if you go deeper into the labyrinth.  The hunt is on."
        },
        {
          "End" : 1,
          "ID" : 3,
          "Text" : "You have tracked down Fleshdoom to the very bowels of Hell.  The demon was a tough adversary, but you have succeeded in slaying him.  Unfortunately, the demon did not have the demon blade Shadowfang.  Maybe he has hidden it deeper in Hell.\n\nYou should let Tremayne know about this."
        }
      ],
      "Name" : "Fleshdoom",
      "Picture" : 65535,
      "Priority" : 4,
      "Tag" : "QST_FLESHDOOM",
      "XP" : 0
    },
    {
      "Comment" : "",
      "EntryList" : [
        {
          "End" : 0,
          "ID" : 1,
          "Text" : "An encounter with a groveling Flesh Clan demon has brought both amusement and intrigue. The creature, which calls itself Gharbad, has begged that you spare its life in exchange for a powerful item that it is crafting \"just for you.\""
        },
        {
          "End" : 1,
          "ID" : 2,
          "Text" : "Not unexpectedly, Gharbad has coupled his cowardice with betrayal, deciding that what he made was too good for you. Or maybe he just got a little greedy. Well, good riddance."
        }
      ],
      "Name" : "Gharbad the Weak",
      "Picture" : 65535,
      "Priority" : 4,
      "Tag" : "QST_GHARBAD",
      "XP" : 0
    },
    {
      "Comment" : "",
      "EntryList" : [
        {
          "End" : 0,
          "ID" : 1,
          "Text" : "After showing a map to Gillian, she mentions that it reminds her of a tale her grandmother told her... about an offering that can be made at the graveyard beside the Cathedral.  What to offer is shrouded in mystery, and what happens after that offering even more uncertain..."
        },
        {
          "End" : 1,
          "ID" : 2,
          "Text" : "The offering that was needed was actually the map itself!  The offering has caused the rusted door of the Crypts to open up.  What lies beyond is for you to find out..."
        }
      ],
      "Name" : "Grave Matters",
      "Picture" : 65535,
      "Priority" : 4,
      "Tag" : "QST_GRAVEMATTERS",
      "XP" : 0
    },
    {
      "Comment" : "",
      "EntryList" : [
        {
          "End" : 0,
          "ID" : 1,
          "Text" : "Gillian has told you of a strange tale that Farnham has said during his drunken ramblings in the tavern.  She says that the drunkard was rambling on about something called \"Azurewrath\", and about a fallen angel under the labyrinth.  She also remembers Farnham mentioning a key in a barrel, or was it a barrel that was the key?  Farnham was also said to be covering his face and muttering \"Izual\" repeatedly.\n\nMaybe you need to ask Cain about this..."
        },
        {
          "End" : 0,
          "ID" : 2,
          "Text" : "Cain has confirmed Farnham's ramblings as the truth, and proceeded to tell you about the saga of Izual and Azurewrath.\n\nIzual's story begins in the lost battles of Hell.  Izual was an angel who was given charge of a holy rune blade called Azurewrath.  The angel led a daring assault on the Hellforge, but was overwhelmed and fatally wounded.  The demons cast the dying angel into a fiery pit, where the powers of chaos transformed into a creature of evil.\n\nThe fallen angel was once again given charge of his blade, Azurewrath, and is now entrusted to defend the very place he attempted to destroy, and sworn to use Azurewrath to defend the very creatures it was meant to slay..."
        },
        {
          "End" : 1,
          "ID" : 3,
          "Text" : "The journey to the Hellforge was wrought with evil and chaos, but you finally faced Izual - no longer recognizable as an angel in his cursed form.  He has questioned your resolve and challenged you, but by sheer will and determination you were able to defeat him - but not destroy him, for the dying angel was once again pulled into the abyss - where he will once again heal his wounds and continue to serve his dark masters.\n\nIzual left behind his angelic rune blade, Azurewrath.  Perhaps the quest to free this fallen warrior of light from the darkness was not a total failure after all.  And perhaps you'll meet him again..."
        }
      ],
      "Name" : "Izual and Azurewrath",
      "Picture" : 65535,
      "Priority" : 4,
      "Tag" : "QST_IZUAL",
      "XP" : 0
    },
    {
      "Comment" : "",
      "EntryList" : [
        {
          "End" : 0,
          "ID" : 1,
          "Text" : "Janna has told you that she is a member of the Sisters of the Sightless Eye, a guild of rogues that operate north of Khanduras.  She was sent by her elders to Tristram to fulfill some sort of \"rite of passage\" before she can be considered a full member.  She says that she has to complete her training and reach a specific level of skill to be recognized as a full-fledged Sister.\n\nYou try to get more details about the specifics of her training, but she says she will tell you more later..."
        },
        {
          "End" : 0,
          "ID" : 2,
          "Text" : "After further prompting, Janna reveals that she has actually had misgivings as to how the Sisters of the Sightless Eye operate in Sanctuary.  She expresses the need for change and told you of her hesitation in suggesting a more active participation from the elders and the other Sisters in dealing with the events that have transpired in Tristram.\n\nShe is hoping that completing her training here would give her enough recognition to encourage the elders of the Sisters of the Sightless Eye to send a delegation of rogues to Tristram and help deal with the problem that has beset the town."
        },
        {
          "End" : 1,
          "ID" : 3,
          "Text" : "Janna tells you that she has finally reached the appropriate level of training and her skill is sufficient to be recognized as a full Sister of the Sightless Eye.  She thanks you wholeheartedly, and said that as soon as she gets back to her guild, she will recommend a sizeable delegation of rogues to come to Tristram and help deal with the ancient evil that has plagued the land - that is, if you don't take care of it first.\n\nShe rewards you with a very valuable cloak, and pledges to be by your side anytime you need her services.  In her apparent glee, she has even come up with a nickname for herself.  Blood Raven seems like an apt name for a rogue who will make the Sisters of the Sightless Eye proud..."
        }
      ],
      "Name" : "Janna's Skill",
      "Picture" : 65535,
      "Priority" : 3,
      "Tag" : "QST_JANNA",
      "XP" : 0
    },
    {
      "Comment" : "",
      "EntryList" : [
        {
          "End" : 0,
          "ID" : 1,
          "Text" : "Despite his sour and sarcastic disposition, you learned that Jarulf is actually a family man (who would've thought).  He says that he left his wife and son to seek fame and fortune.  It's a far-fetched story, but Jarulf insists that he came to Tristram seeking honor and glory, boasting that he was the only one from his village who was brave enough to undertake the journey to Tristram and wage battle against \"whatever bad mojo that has slipped its slimy tentacle into the orifice that is Tristram\" (his words).\n\nAs much as you want him to share some more of his dubious claims, he refuses to share more information to you until he has known you better..."
        },
        {
          "End" : 0,
          "ID" : 2,
          "Text" : "After much coaxing, you finally discover why Jarulf has come to Tristram.  Behind the mean-spirited bravado is a troubled man who has something to prove...\n\nAccording to Jarulf, he came back from an ill-fated war a broken man.  King Leoric's madness drove most of the small villages of Khanduras to the brink of poverty, and the declaration of war with the northern kingdoms of Westmarch did little to help the sorry state of Leoric's lands.  Once a farmer, Jarulf was forced to join the army in the hopes of earning much needed gold to save his dwindling crops and livestock.  With the untimely deposition of the mad king, the armies of Khanduras were left demoralized and penniless.  Jarulf was forced to pawn off what remained of his livestock as well as his house to keep his family afloat amid the ensuing depression left by the debacle.  Unfortunately, it was not enough, and he realized that, unless he can find enough money to pay off his debts, he and his family would be thrown out to the streets.\n\nJarulf said that he then decided to find a way to earn some coin elsewhere, and the quickest way to do so was to go where the gold flowed - treasure hunting and mercenary work.  For the last few months, Jarulf has wandered from place to place earning as much as he can as a hired mercenary, but the gold still trickled slowly, and the last time he saw his wife and son, they were working as servants to an abusive old woman in their village.  Jarulf is distressed by this and desperately wants to regain his family's honor.\n\nThe only way he can do this is to pay off all his outstanding debts, and build a new home for him and his family, work the farm again, and live in peace.  He mentions that the exact amount he needs to cover everything is five hundred thousand gold pieces.  He seems sincere in this request, and asks for your help.  Maybe when you get enough gold, you can save Jarulf's honor by giving him the gold he needs to start a new life with his family..."
        },
        {
          "End" : 1,
          "ID" : 3,
          "Text" : "You finally had enough gold to give to Jarulf and help him out in his predicament.  Jarulf tries to hide it, but he is visibly grateful and appreciative of your generous offer to help him pay off his debts and restore his family's honor.  He has expressed an interest to start a new life in the shining city of Luth Golein, where nobody knows his past and where he, his wife Atma, and his son can face new challenges as a family.\n\nHe rewards you with a belt that has been handed down to him by his grandfather, and he vows to stand by you as long as you need him, until the time comes when you don't need his services anymore, and he can go back to his family, start a new life with them and live in peace at last..."
        }
      ],
      "Name" : "Jarulf's Honor",
      "Picture" : 65535,
      "Priority" : 3,
      "Tag" : "QST_JARULF",
      "XP" : 0
    },
    {
      "Comment" : "",
      "EntryList" : [
        {
          "End" : 0,
          "ID" : 1,
          "Text" : "You encountered a knight in Hell named Lachdanan. He said he was once captain of King Leoric's knights, and has also incurred the wrath of the fallen king for their role in his tragic death... He said that he fled from the cursed king's burial chamber to seek a way to free himself of the terrible curse, but has failed to find one.\n\nHowever, he mentions a golden elixir that could help lift the curse that has befallen him and allow his soul to finally rest, but he has been unable to find it.  He has asked your aid in retrieving the elixir, and has promised to repay your efforts..."
        },
        {
          "End" : 0,
          "ID" : 2,
          "Text" : "You have found the golden elixir that Lachdanan has been looking for.  Perhaps it is time for you to bring it back to him and release him from his terrible curse..."
        },
        {
          "End" : 1,
          "ID" : 3,
          "Text" : "Lachdanan is grateful to you for obtaining the golden elixir, and as promised, he gave you his helm.  May this tragic hero finally rest in peace..."
        }
      ],
      "Name" : "Lachdanan",
      "Picture" : 65535,
      "Priority" : 2,
      "Tag" : "QST_LACHDANAN",
      "XP" : 0
    },
    {
      "Comment" : "",
      "EntryList" : [
        {
          "End" : 0,
          "ID" : 1,
          "Text" : "After some convincing, Mello tells you that the healers within the brotherhood have determined the disease is may be more an effect of something other than a malignant infection.\n\nThe monks in the Brotherhood of the Bough are deeply attuned to their surroundings.  They are so deeply attuned to the land that they feel what nature itself feels.  For them to experience such a drastic and dire malady could only mean that something very bad is happening to the land.  Something is seriously killing nature, and it is affecting the monks.  Mello said that it would eventually affect everyone in Sanctuary.\n\nWhen the monks heard of the strange and terrible events that were taking place in Tristram, they sent Mello to investigate and see if there might be something that can lead them to a cure - that there may be some sort of connection with the strange sickness within the Brotherhood, and in the process find the cure.  \n\nMello says that he was told what the cure might be, but he would not tell you until you have seen more of Tristram and found any places that Mello can recognize as significant to his quest..."
        },
        {
          "End" : 0,
          "ID" : 2,
          "Text" : "Mello finally tells you what the cure is, and it happens to be more than you bargained for.\n\nThe elders of the Brotherhood have long believed that there are creatures that existed in this world long before mortals walked the earth.  After the desolation left by the war that seemed to have been the Great Conflict, where angels and demons fought for supremacy, these creatures proliferated and spread their brood all over the bleak landscape.  But before the first mortal was ever born in this world, there was a great cataclysm that wiped out almost all these creatures from the face of the earth.  Some managed to survive by burrowing deep in the subterranean regions of the earth and went into a deep slumber.\n\nIt seems that this slumber has ended, and the sinister brood that overran the earth a thousand years ago are trying to extricate themselves from their primeval shelters and once again claim dominance over this world.  The elders believe that a hive queen, one that they have named the Defiler - is leading these creatures\n\nIt is now clear to you that you must kill this Defiler to prevent it from further contaminating the earth and consuming every human being to satisfy their hunger.  Mello says that only by bringing back the creature's heart to the Brotherhood can the monks be saved from the poisonous sickness that has stricken them."
        },
        {
          "End" : 1,
          "ID" : 3,
          "Text" : "The Defiler is dead by your hand, and in your possession is its vile heart.  You have not only saved mankind from the impending invasion of the brood, but you have also secured the thing that will save the Brotherhood of the Bough from the sickness that has fallen upon it.\n\nMello is grateful to you for helping him secure the Defiler's heart, and he says he will bring it back to his order as soon as he can.  He has given you a pair of sandals that was an integral part of being in the Brotherhood - not a trivial thing for a monk to pass on to an outsider.  It was his way of repaying you for your efforts to save the monks."
        }
      ],
      "Name" : "Mello's Cure",
      "Picture" : 65535,
      "Priority" : 3,
      "Tag" : "QST_MELLO",
      "XP" : 0
    },
    {
      "Comment" : "",
      "EntryList" : [
        {
          "End" : 0,
          "ID" : 1,
          "Text" : "With the death of Fleshdoom, you expected to see the cursed demon blade Shadowfang on him, but to your dismay he has hidden it deeper in Hell.  You should find it as soon as possible and bring it back to the priest Tremayne so that he can dispose of its evil forever."
        },
        {
          "End" : 0,
          "ID" : 2,
          "Text" : "After several grueling battles within Hell, you have finally found where Fleshdoom has hidden Shadowfang - near the fiery gates of the Hellforge!  You must now bring it back to Tremayne so that he can destroy it...  but the temptation to wield the powerful demon blade is strong, as it seems to whisper into your mind.  You must try to resist, lest it corrupt you."
        },
        {
          "End" : 0,
          "ID" : 3,
          "Text" : "The demon blade proved too strong for even Tremayne to control, and the priest has succumbed to the demon blade's vengeful curse.  Tremayne has been corrupted and transformed into a creature of evil, and you were forced to slay him.\n\nThe priest's dying words implored you to bring Shadowfang back to Hell and cast it into the Hellforge, where he says it will be destroyed in the same place it was forged.  It is up to you to end the demon blade's evil - or risk its growing corruption on your soul..."
        },
        {
          "End" : 1,
          "ID" : 4,
          "Text" : "The way to Hell has been wrought with evil, and the march to the Hellforge even worse.  But you have succeeded in destroying Shadowfang.  It will corrupt no one anymore, and the suffering it has caused has finally ended..."
        }
      ],
      "Name" : "Shadowfang",
      "Picture" : 65535,
      "Priority" : 2,
      "Tag" : "QST_SHADOWFANG",
      "XP" : 0
    },
    {
      "Comment" : "",
      "EntryList" : [
        {
          "End" : 0,
          "ID" : 1,
          "Text" : "Griswold told you that there was a mystic anvil within the labyrinth, and he thinks that it could be the Anvil of Fury.  He said that stories mentioned the anvil possessed the very essence of the demonic underworld, and any weapon crafted upon it is imbued with great power.  He tells you that if you can find it, he will craft a weapon suited for you."
        },
        {
          "End" : 0,
          "ID" : 2,
          "Text" : "Griswold told you that there was a mystic anvil within the labyrinth, and he thinks that it could be the Anvil of Fury.  He said that stories mentioned the anvil possessed the very essence of the demonic underworld, and any weapon crafted upon it is imbued with great power.  He tells you that if you can find it, he will craft a weapon suited for you.\n\nYou found the Anvil of Fury in the middle of caverns, just resting on top of an abandoned forge.  You should take it back to Griswold so he can make you a weapon out of it..."
        },
        {
          "End" : 1,
          "ID" : 3,
          "Text" : "Griswold told you that there was a mystic anvil within the labyrinth, and he thinks that it could be the Anvil of Fury.  He said that stories mentioned the anvil possessed the very essence of the demonic underworld, and any weapon crafted upon it is imbued with great power.  He tells you that if you can find it, he will craft a weapon suited for you.\n\nYou found the Anvil of Fury in the middle of caverns, just resting on top of an abandoned forge.  You should take it back to Griswold so he can make you a weapon out of it...\n\nGriswold was ecstatic at seeing the Anvil of Fury now in his hands.  He has now made you a weapon that you can use in your adventures deeper into the labyrinth..."
        }
      ],
      "Name" : "The Anvil of Fury",
      "Picture" : 65535,
      "Priority" : 2,
      "Tag" : "QST_ANVIL",
      "XP" : 0
    },
    {
      "Comment" : "",
      "EntryList" : [
        {
          "End" : 0,
          "ID" : 1,
          "Text" : "The Book of Blood says: \"Beyond the hall of heroes and past the hall of fire, Valor awaits for the hero of light to awaken...\"\n\nSeems cryptic to you.  Perhaps you should ask Cain if he knows about it..."
        },
        {
          "End" : 0,
          "ID" : 2,
          "Text" : "Cain told you the story of the ancient hero Arkaine, who was the first mortal to turn the tide of the Sin War and chase the legions of darkness back to the Burning Hells.  Valor was the holy armor he wore, and before his death, Arkaine hid this armor in a secret vault, waiting for a hero of light to reclaim it and use it to battle the forces of darkness once more..."
        },
        {
          "End" : 1,
          "ID" : 3,
          "Text" : "Cain told you the story of the ancient hero Arkaine, who was the first mortal to turn the tide of the Sin War and chase the legions of darkness back to the Burning Hells.  Valor was the holy armor he wore, and before his death, Arkaine hid this armor in a secret vault, waiting for a hero of light to reclaim it and use it to battle the forces of darkness once more...  \n\nBeyond Arkaine's sacred tomb lay Valor, his holy armor.  You now possess it, and you are now entrusted to continue his war with the evil that imperils this land..."
        }
      ],
      "Name" : "The Armor of Valor",
      "Picture" : 65535,
      "Priority" : 2,
      "Tag" : "QST_ARKAINE",
      "XP" : 0
    },
    {
      "Comment" : "",
      "EntryList" : [
        {
          "End" : 0,
          "ID" : 1,
          "Text" : "After finding some bandits who have been cornered in the forest, you met their 'charismatic' leader, Jacho Carlias. He says that his bandit group has been ambushed by monsters, and most of their men have been carried away - dead or barely alive - deep into the forest, and the surviving bandits are now cornered in the middle of the forest with no way out.  He says he can force his way through, but not without his brother Vico, who has gone missing after he went into the forest to look for his missing men.\n\nThe bandit leader has asked for your help, and promises to reward you generously if you can find his brother."
        },
        {
          "End" : 0,
          "ID" : 2,
          "Text" : "You saw that Vico has been kept in a fenced enclosure deep within the cursed caverns.  Unfortunately, he is dead - another ill-fated morsel by the lycanthropes in this place. The jail warden uttered the name \"Andariel\" in his dying breath.  Perhaps you need to ask Cain about it.  For now, you need to go back to Jacho Carlias and tell him the bad news."
        },
        {
          "End" : 1,
          "ID" : 3,
          "Text" : "Jacho was strangely casual about his brother's death - clearly there was regret, but he thinks his brother deserved whatever happened to him.  But he was grateful for knowing Vico's fate and he rewards you - and gives you a stern warning about not going back to the woods.  Maybe there is some merit to his warning, but checking to find out probably won't hurt ... much."
        },
        {
          "End" : 1,
          "ID" : 4,
          "Text" : "You told Jacho that you did not find his brother, Vico.  He was strangely casual about his brother's fate - clearly there was regret, but he thinks his brother deserved whatever happened to him.  If there was ever honor among thieves, it was not evident in this case.  Jacho shrugged it off and went about his business as usual, telling you that he will be leaving this part of the forest towards the south.\n\nWhile part of you scoffs at this attitude, another silently envies this stalwart lack of emotion..."
        }
      ],
      "Name" : "The Bandit's Brother",
      "Picture" : 65535,
      "Priority" : 2,
      "Tag" : "QST_BANDIT",
      "XP" : 0
    },
    {
      "Comment" : "",
      "EntryList" : [
        {
          "End" : 0,
          "ID" : 1,
          "Text" : "Finding a fungal tome leads you back to Adria, who has identified it as a book of reagents.  She then asks you to seek out a black mushroom, perhaps to use in making one of her spells or potions.  She said it was fairly large and easy to see.  As much as you have better things to do than fetch something so trivial as a black mushroom, you decided that maybe the rewards would be worthwhile."
        },
        {
          "End" : 0,
          "ID" : 2,
          "Text" : "You found a black mushroom within the Caverns!  Time to bring it back to Adria and possible get your reward..."
        },
        {
          "End" : 0,
          "ID" : 3,
          "Text" : "You return the black mushroom to Adria, but instead of a reward, she gives you yet another errand:  she said that that the healer, Pepin, is looking for the brain of a demon to use in treating the wounds caused by their poisonous venom.  She said that Pepin plans to make an elixir from it, and wants you to find the demon brain and bring it to the healer, then get a sample of the elixir to bring back to her...\n\nThis is quest becoming a little convoluted, but you push on..."
        },
        {
          "End" : 0,
          "ID" : 4,
          "Text" : "You return the black mushroom to Adria, but instead of a reward, she gives you yet another errand:  she said that that the healer, Pepin, is looking for the brain of a demon to use in treating the wounds caused by their poisonous venom.  She said that Pepin plans to make an elixir from it, and wants you to find the demon brain and bring it to the healer, then get a sample of the elixir to bring back to her...\n\nUpon retrieving the demon brain and giving it to Pepin, you learn that the healer has finished the elixir without it!  Nevertheless, Pepin gives you a sample of the elixir to give back to the witch.  Hopefully this fool's errand won't take you much longer..."
        },
        {
          "End" : 1,
          "ID" : 5,
          "Text" : "You return the black mushroom to Adria, but instead of a reward, she gives you yet another errand:  she said that that the healer, Pepin, is looking for the brain of a demon to use in treating the wounds caused by their poisonous venom.  She said that Pepin plans to make an elixir from it, and wants you to find the demon brain and bring it to the healer, then get a sample of the elixir to bring back to her...\n\nUpon retrieving the demon brain and giving it to Pepin, you learn that the healer has finished the elixir without it!  Nevertheless, Pepin gives you a sample of the elixir to give back to the witch. \n\nYou tried to give the elixir back to the witch, but she has become impatient during your round of errands and has been able to finish her brew without it.  She tells you to keep it...  Maybe the elixir's effects can stave off your annoyance at having been sent on this errand..."
        }
      ],
      "Name" : "The Black Mushroom",
      "Picture" : 65535,
      "Priority" : 2,
      "Tag" : "QST_MUSHROOM",
      "XP" : 0
    },
    {
      "Comment" : "",
      "EntryList" : [
        {
          "End" : 0,
          "ID" : 1,
          "Text" : "The dying words of a townsman have prompted you to go on a quest for revenge - against a creature known as the Butcher. This monster has slaughtered many of the townsfolk who came down to the church to rescue the lost prince - part of the treachery of the Archbishop Lazarus. But a creature that can kill so many men is not to be taken lightly. Farnham was one of the townspeople who ventured into the labyrinth. Perhaps he knows something about this monstrosity..."
        },
        {
          "End" : 1,
          "ID" : 2,
          "Text" : "The Butcher is now dead by your hands. The spirits of the dead are now avenged.."
        },
        {
          "End" : 1,
          "ID" : 3,
          "Text" : "The Butcher is now dead by your hands.  It didn't have a chance against your onslaught..."
        }
      ],
      "Name" : "The Butcher",
      "Picture" : 65535,
      "Priority" : 2,
      "Tag" : "QST_BUTCHER",
      "XP" : 0
    },
    {
      "Comment" : "",
      "EntryList" : [
        {
          "End" : 0,
          "ID" : 1,
          "Text" : "You found a mysterious book in the catacombs that tells of a Chamber of Bone.  It also says that fantastic riches await whoever enters that place.  Perhaps you should ask Cain about it before you go further..."
        },
        {
          "End" : 0,
          "ID" : 2,
          "Text" : "Cain tells you that archaic writings do mention a Chamber of Bone, and it was inferred that the lords of the underworld sought to protect their great treasures, and created a domain where those who attempted to steal their treasure were forever bound to defend it.\n\nSounds like getting those treasures would not be as easy as you earlier thought..."
        },
        {
          "End" : 1,
          "ID" : 3,
          "Text" : "The Chamber of Bone was truly a dark place, as you encountered hordes of the undead that fiercely defended it.  But your persistence proved too much for them, and you finally attained the treasures you sought..."
        }
      ],
      "Name" : "The Chamber of Bone",
      "Picture" : 65535,
      "Priority" : 2,
      "Tag" : "QST_CHAMBER",
      "XP" : 0
    },
    {
      "Comment" : "",
      "EntryList" : [
        {
          "End" : 0,
          "ID" : 1,
          "Text" : "Something evil has come to the town of Tristram.  People are dying and a great darkness seems to have befallen the labyrinth beneath the Cathedral.  Going down the dark steps of the church might give you some answers as to what is happening to Tristram."
        },
        {
          "End" : 0,
          "ID" : 2,
          "Text" : "You have discovered that the Archbishop Lazarus, once one of King Leoric's trusted advisors, seemed to have brought an ancient evil to Tristram.  But you suspect that the vile betrayer is only a tool in a grander scheme - one that you have to find out with haste..."
        },
        {
          "End" : 1,
          "ID" : 3,
          "Text" : "You discover from Cain that the evil that has covered the land of Tristram can only be from the Dark Lord of Terror himself - Diablo - who has awakened from the deepest bowels of the labyrinth after several centuries of waiting..."
        },
        {
          "End" : 1,
          "ID" : 4,
          "Text" : "You have already conquered the evil below the church., yet you have come back to Tristram - perhaps because of unfinished business."
        },
        {
          "End" : 1,
          "ID" : 5,
          "Text" : "You have already conquered the evil below the church., yet you have come back to Tristram - perhaps because of unfinished business.\n\nA mysterious portal has appeared near the outskirts of town that may be worth investigating..."
        }
      ],
      "Name" : "The Coming of Darkness",
      "Picture" : 65535,
      "Priority" : 4,
      "Tag" : "QST_MAINMODULE",
      "XP" : 0
    },
    {
      "Comment" : "",
      "EntryList" : [
        {
          "End" : 0,
          "ID" : 1,
          "Text" : "You have found what seems to be a junction between parallel planes - the Cornerstone of the World.  It is unclear what task you need to fulfill in this place, but perhaps investigating each of the four planes will bring up some answers..."
        },
        {
          "End" : 0,
          "ID" : 2,
          "Text" : "Having attained all the totems from each of the four worlds in the Cornerstone of the World, you wonder what their purpose might be.  Perhaps you should go back to the cornerstone portal and see if you can find answers there..."
        },
        {
          "End" : 1,
          "ID" : 3,
          "Text" : "What you found at the end of the portal was the utmost corruption of sentient life - sentient farm life, that is.  But you have emerged triumphant, and along with your victory are the unimaginable spoils of battle.\n\nMaybe you should stop by this place again next time..."
        }
      ],
      "Name" : "The Cornerstone of the World",
      "Picture" : 65535,
      "Priority" : 2,
      "Tag" : "QST_CORNERSTONE",
      "XP" : 0
    },
    {
      "Comment" : "",
      "EntryList" : [
        {
          "End" : 0,
          "ID" : 1,
          "Text" : "Ogden has told you about the plight of the fallen King Leoric.  It seems that months ago, King Leoric's son, Prince Albrecht, was kidnapped, which drove the king into a mad rage and inadvertently blamed the town for his son's disappearance.  The king's mysterious madness was so great that his once loyal knights and priests were forced to kill him, but not before the king has called down a terrible curse on them, dooming them to serve him in darkness forever.\n\nBut recently it has been discovered that the former king has risen from his eternal sleep, and is now commanding a legion of undead minions within the labyrinth. Ogden has asked you to put down the fallen king once more - for good. The entrance to the King Leoric's tomb is believed to be located three levels below the Cathedral."
        },
        {
          "End" : 0,
          "ID" : 2,
          "Text" : "King Leoric has been corrupted beyond understanding, but you have managed to finally put his soul to rest.  You swore a silent oath to find his son.  You must go back to Ogden and let him know that the task is done. The curse of the Black King is finally lifted."
        },
        {
          "End" : 1,
          "ID" : 3,
          "Text" : "King Leoric has been corrupted beyond understanding, but you have managed to finally put his soul to rest.  You swore a silent oath to find his son. You tell Ogden of this, and the tavern owner says that this may all be a part of a greater evil at work.  Nevertheless, he is grateful to you for ending the fallen king's torment."
        }
      ],
      "Name" : "The Curse of King Leoric",
      "Picture" : 65535,
      "Priority" : 2,
      "Tag" : "QST_LEORIC",
      "XP" : 0
    },
    {
      "Comment" : "",
      "EntryList" : [
        {
          "End" : 0,
          "ID" : 1,
          "Text" : "Upon entering what seems like a primordial corruption of the subterranean areas, you heard a voice that chilled you to your very bones:\n\n\"We have long lain dormant, and the time to awaken has come!  After our long sleep, we are filled with great hunger. Soon, now, we shall feed...\"\n\nThis mysterious voice seems to be coming deep within this nest... yet another evil that has come to Tristram that you must face...  The vile stench of this place fills your nostrils as you trudge deeper into the hive..."
        },
        {
          "End" : 0,
          "ID" : 2,
          "Text" : "The voice has once again surfaced, this time with a promise:\n\n\"These lands shall be defiled, and our brood shall overrun the fields that men call home!  Our tendrils shall envelope this world, and we will feast on the flesh of its denizens!  Man shall become our chattel and sustenance!\"\n\nThe stench is growing stronger...."
        },
        {
          "End" : 1,
          "ID" : 3,
          "Text" : "A grueling battle with the denizens of the hive has set you up with a confrontation with the owner of the voice you have been hearing - the Defiler.  A huge abomination of nature, with an evil intent that is only surpassed by its hunger.  But your weapons proved stronger than her hunger, as you succeed in slaying this overgrown vermin.\n\nThe hive seems quieter now, and the world is not aware of the evil that almost overran it..."
        }
      ],
      "Name" : "The Defiler",
      "Picture" : 65535,
      "Priority" : 2,
      "Tag" : "QST_DEFILER",
      "XP" : 0
    },
    {
      "Comment" : "",
      "EntryList" : [
        {
          "End" : 0,
          "ID" : 1,
          "Text" : "Upon entry into the Crypts, you encountered a journal written by someone named Skulken that tells of a demonic creature that lies within this place that must be stopped.  The one who wrote the scroll said that the demon's minions are scattered within the area, trying to free their dark master.  It is also written that this Skulken has hobbled the demon with arcane magic and has succeeded in containing the creature somewhere in the Crypts - but he also writes that this containment may not be enough to hold it.\n\nThe journal is missing some pages.  Maybe finding these pages will shed some more light as to where this demon is trapped - and perhaps a way to stop it from escaping the crypts..."
        },
        {
          "End" : 0,
          "ID" : 2,
          "Text" : "You found an entry in one of Skulken's journals within the Crypts that mention the creature's name - Na-krul.  The demon is said to have been banished into the void, and is waiting for its time to escape and exact retribution upon the one that sent it there..."
        },
        {
          "End" : 0,
          "ID" : 3,
          "Text" : "Upon finding all three of the torn notes from Skulken's journal, you discover that the demon is trapped deep within the Crypts, but is held back by spells within three grimoires.  The completed notes also mention levers in front of the demon's prison - but warns not to touch them, for they will free the trapped demon and you will have to fight against its fully regained powers.\n\nHowever, the spells within the three grimoires are said to be able to weaken the demon considerably, but only if cast in their proper sequence.  The journal entry lists the proper order in which the spells need to be cast:\n\nIn Spiritu Sanctum\nPraedictum Otium\nEfficio Obitus Ut Inimicus"
        },
        {
          "End" : 1,
          "ID" : 4,
          "Text" : "You have succeeded in defeating the demon named Na-krul - the creature that was trapped by the ill-fated mage who ensnared it and wrote the journal notes you have found.  The identity of this Skulken remains a mystery, but you decided that having vanquished yet another evil in this world should be enough for now.\n\nThere is nothing else for you to do within the Crypts.  You should continue on with your quest to defeat the evil that has darkened Tristram.  You only hope that the results of your campaign in the Crypts has made you strong enough to face that evil..."
        }
      ],
      "Name" : "The Demon in the Crypts",
      "Picture" : 65535,
      "Priority" : 1,
      "Tag" : "QST_NAKRUL",
      "XP" : 0
    },
    {
      "Comment" : "",
      "EntryList" : [
        {
          "End" : 0,
          "ID" : 1,
          "Text" : "A farmer named Lester has asked if you can do a favor for him.  He says that something strange has overgrown his little orchard, and because of this he is unable to come back to it and get his supplies.  Lester said that the witch Adria has given him something that might be useful in getting rid of this strange overgrowth, but had has not had the time to use it because of his farming duties.  He has asked if you can do it for him, and has given you what appears to be a bomb of some sort.\n\nLester said that his orchard was located south of town.  This quest seems straightforward enough..."
        },
        {
          "End" : 1,
          "ID" : 2,
          "Text" : "You have succeeded in blowing up the strange growth that has blanketed the farmer's orchard.  Lester is overjoyed by this and gives you a trinket as a reward."
        }
      ],
      "Name" : "The Farmer's Orchard",
      "Picture" : 65535,
      "Priority" : 2,
      "Tag" : "QST_ORCHARD",
      "XP" : 0
    },
    {
      "Comment" : "",
      "EntryList" : [
        {
          "End" : 0,
          "ID" : 1,
          "Text" : "The Dark Book tells you a cryptic poem:\n\n\"I can see what you see now.\nVision milky then eyes rot.\nWhen you turn they will be gone,\nWhispering their hidden song.\nThen you see what cannot be,\nShadows move where light should be.\nOut of darkness, out of mind...\nCast down into the Halls of the Blind...\"\n\nPerhaps Cain will know what this poem means..."
        },
        {
          "End" : 0,
          "ID" : 2,
          "Text" : "After hearing the cryptic poem, Cain said it reminded him of other works, and proceeded to recite this poem:\n\n\"Darkness shrouds the hidden,\nEyes glowing unseen, \nWith only the sound of razor claws briefly scraping, \nTo torment those poor souls, \nWho have been made sightless for all eternity... \n\nThe prison for those so damned is named,\nthe Halls of the Blind...\""
        },
        {
          "End" : 1,
          "ID" : 3,
          "Text" : "The Halls of the Blind was inhabited by vile creatures that hide in the shadows of the pitch black darkness... But you were successful in obtaining a valuable item from their shrouded altar."
        }
      ],
      "Name" : "The Halls of the Blind",
      "Picture" : 65535,
      "Priority" : 2,
      "Tag" : "QST_BLIND",
      "XP" : 0
    },
    {
      "Comment" : "",
      "EntryList" : [
        {
          "End" : 0,
          "ID" : 1,
          "Text" : "Griswold tells you of a caravan that passed by Tristram not long ago.  It supposedly carried a \"piece of the heavens\" that has fallen to earth.  But the caravan was ambushed by cloaked riders just north of the village, by the roadway.  Griswold searched the wreckage and did not find any trace of this \"heaven stone.\" He tells you that if you can find it, he'll make an item out of it for you."
        },
        {
          "End" : 1,
          "ID" : 3,
          "Text" : "After finding the heaven stone in the forest in a stolen wagon, you bring it back to Griswold, and he has fulfilled his end of the bargain by giving you a silver ring that can help you in your journeys in the labyrinth."
        },
        {
          "End" : 0,
          "ID" : 2,
          "Text" : "You seem to have found the heaven stone that Griswold was looking for in the forest - in a stolen wagon near the corpse of the person who possibly stole it.  You need to get it back to the blacksmith immediately."
        }
      ],
      "Name" : "The Heaven Stone",
      "Picture" : 65535,
      "Priority" : 2,
      "Tag" : "QST_MAGICROCK",
      "XP" : 0
    },
    {
      "Comment" : "",
      "EntryList" : [
        {
          "End" : 0,
          "ID" : 1,
          "Text" : "Farnham has had another one of his wild stories - this time he speaks of \"an island where angels watched\"... He also said to \"pick the right rocks, but shield your eyes, shield everything...\"  Even though this may be the rambling of a drunk, it probably wouldn't hurt to ask Cain about it..."
        },
        {
          "End" : 0,
          "ID" : 2,
          "Text" : "Cain has seemingly confirmed Farnham's story about the island where angels watched.  He quoted the following from the ancient Chronicles of the Sin War:\n\n\"In a time long forgotten, a sea of blue rested on the edge of a fiery netherworld.  This was an oasis for those who acted as the watchmen over the gates of Hell.  Angels and warriors of light could use this place to heal themselves, and gather their strength.  It was also a staging area where they could train and prepare for the Sin War.\"\n\nCain also says that the legends speak of a trinity of rocks that hide the path to this \"island of the sunless sea.\"  Perhaps this place is worth investigating - if you can find out where it is..."
        },
        {
          "End" : 0,
          "ID" : 3,
          "Text" : "You have discovered the place that Farnham has told you, and Cain was right about the trinity of rocks that denied entrance to this place.  On that island was a sight that gave you a faint shiver to your very being...\n\nThere were angels, all keeping watch over heavenly armories situated on island.  At the center of the island, you met an angel named Hadriel, who gave you some insight on the purpose of the island, as well as further thoughts about the Sin War and why this war was much bigger than mere mortals have imagined.\n\nStrangely, he has made a request of you - he has told you to bring Farnham back to the island...  He did not say his reasons, but he promises you access to the armories if you can do the seemingly \"simple\" task of bringing Farnham to the island."
        },
        {
          "End" : 1,
          "ID" : 4,
          "Text" : "After much reluctance, you convinced Farnham to go with you - but he was so drunk that you had to carry him back to the island.\n\nHadriel was pleased to see Farnham - a vague recognition passed between the two that seems strange to you.  How can a drunkard know an angel that has probably lived for millennia?  But all your questions were set aside as Hadriel convinced Farnham to \"go back to the light\" ... and Farnham was no more...\n\nThe significance of these events escapes you, but you already have enough unanswerable questions plaguing your mind.  Your task here is done, and Hadriel has allowed you access to the heavenly armories...  A part of you relishes the rewards, but a small part also wishes that Farnham is now content - wherever he may be right now..."
        }
      ],
      "Name" : "The Island Where Angels Watched",
      "Picture" : 65535,
      "Priority" : 4,
      "Tag" : "QST_ISLAND",
      "XP" : 0
    },
    {
      "Comment" : "",
      "EntryList" : [
        {
          "End" : 0,
          "ID" : 1,
          "Text" : "A feisty cow (yes, a cow) in Tristram has told you (yes, it actually talks) so sorrowfully that several weird creatures have disturbed its home, and now he can't go home.  The cow (yes, the same cow) also tells you that everything would've been okay if he had something to wear.\n\nAlthough it seems hopelessly absurd, and for lack of anything better to do, you decide to agree to help the hapless Holstein by agreeing to retrieve his suit - the brown one, not the grey one which is evening wear.  He says his house is south, near the fork in the river.  You can only wish that the rewards for this ridiculous quest would be worth it..."
        },
        {
          "End" : 1,
          "ID" : 2,
          "Text" : "You have finally retrieved the cow's brown suit, and he rewards you with treasure, and a tacky little fashion tip..."
        }
      ],
      "Name" : "The Jersey's Jersey",
      "Picture" : 65535,
      "Priority" : 2,
      "Tag" : "QST_COW",
      "XP" : 0
    },
    {
      "Comment" : "",
      "EntryList" : [
        {
          "End" : 0,
          "ID" : 1,
          "Text" : "Deckard Cain tells you that the evil you move against is the Dark Lord of Terror - Diablo - who has been imprisoned deep within the labyrinth for many centuries.  But the dark lord has awaked to once again sow chaos and havoc on mankind.  It is up to you to stop Diablo from unleashing his wrath on Tristram and the world."
        },
        {
          "End" : 1,
          "ID" : 2,
          "Text" : "You have killed the Dark Lord of Terror at great cost to you and your soul.  But the town of Tristram is safe once again, and the essence of Diablo has been contained... for now..."
        }
      ],
      "Name" : "The Lord of Terror",
      "Picture" : 65535,
      "Priority" : 0,
      "Tag" : "QST_DIABLO",
      "XP" : 0
    },
    {
      "Comment" : "",
      "EntryList" : [
        {
          "End" : 0,
          "ID" : 1,
          "Text" : "Deese has asked you to help in finding his two sons, Inneas and Roof, who have been missing for the past few days.  The farmer tells you that the two young men saw strange lights deep within the forest just before they went missing.  He does not know what might be causing this, and he seems too afraid to leave town because of the recent activities by cloaked riders in the north.  He mentions that Gillian knows something about these strange lights and urges you to ask her.\n\nMaybe investigating the forest north of town may give you some answers as the whereabouts of the Deese's missing sons... But you need to ask Gillian about these strange lights first..."
        },
        {
          "End" : 0,
          "ID" : 2,
          "Text" : "Gillian has told you that men have been disappearing from the village, and that Deese's sons, Inneas and Roof, have been missing for some time now.  She says a crimson shimmering light deep within the woods that the two young men have claimed to have seen prior to their disappearance may have something to do with it, for they have never been heard from again since they reported that strange occurrence.\n\nMaybe investigating the forest north of town may give you some answers as the whereabouts of the Deese's missing sons, as well as finding out why men are disappearing from the village..."
        },
        {
          "End" : 0,
          "ID" : 3,
          "Text" : "You found the lost boys, Roof and Inneas, in a fenced enclosure deep within the forest caverns.  Unfortunately, they are both dead, victims of the lycanthropes in this who have set them aside for private feeding.  Along with their corpses, you realize that the missing men may be the victims of a darker evil than the monsters in the caverns.  Deese would be heartbroken if he knew that both his sons are dead, and a grisly death at that. \n\nThe jail warden uttered the name \"Andariel\" in his dying breath.  Perhaps you need to ask Cain about it."
        },
        {
          "End" : 1,
          "ID" : 4,
          "Text" : "Deese is devastated by the news of his sons' deaths.  Horribly grief-stricken, he has vowed to leave Tristram forever.  A part of you wishes that he should have done so a long time ago..."
        },
        {
          "End" : 1,
          "ID" : 5,
          "Text" : "You did not tell Deese about the death of his sons, and instead told him that the boys have left Tristram to start new lives outside the town.  He was disappointed that you did not get to convince his sons to stay in Tristram, but he has accepted that truth in a favorable light.  A white lie is better than the dark truth in this situation..."
        }
      ],
      "Name" : "The Lost Boys",
      "Picture" : 65535,
      "Priority" : 2,
      "Tag" : "QST_LOSTBOYS",
      "XP" : 0
    },
    {
      "Comment" : "",
      "EntryList" : [
        {
          "End" : 0,
          "ID" : 1,
          "Text" : "You discovered a foul creature named Snotspill, who is guarding the door - and the stairs - that will lead you down deeper into the labyrinth.  He denies you entry, but tells you that if you can find a \"magic banner\" and give it back to him, he will let you pass.  He says that \"big uglies\" have it, and you can find them if you go past the corner and enter a door...\n\nFor now, time to face these \"big uglies\" and get this \"magic banner\" back so you can go forward in your quest..."
        },
        {
          "End" : 1,
          "ID" : 2,
          "Text" : "You have obtained a tavern sign from the \"big uglies\" who were carrying it.  You gave it back to Snotspill, who tried to kill you anyway.  Perhaps next time, you would think twice before \"helping\" these dark creatures achieve their goals in the future..."
        },
        {
          "End" : 1,
          "ID" : 3,
          "Text" : "Snotspill's magic banner and Ogden's missing tavern sign turned out to be one and the same!  You decided to return the sign Ogden, and got a somewhat decent reward for your efforts..."
        }
      ],
      "Name" : "The Magic Banner",
      "Picture" : 65535,
      "Priority" : 2,
      "Tag" : "QST_MAGICBANNER",
      "XP" : 0
    },
    {
      "Comment" : "",
      "EntryList" : [
        {
          "End" : 0,
          "ID" : 1,
          "Text" : "It seems that someone (or something) has stolen the tavern sign of Ogden's establishment during the night. Ogden caught a glimpse of small, demon-like figures running away with it. This odd behavior is baffling, but surely there must be a reason behind it. Only by finding the missing tavern sign will the answer become evident."
        },
        {
          "End" : 1,
          "ID" : 2,
          "Text" : "You have obtained Ogden's missing tavern sign from the vile creatures that had it.  Even though he doesn't expect it to be returned, you do so anyway. Ogden seems naturally indifferent about it but gives you a decent reward, nevertheless."
        },
        {
          "End" : 1,
          "ID" : 3,
          "Text" : "The tavern sign that Ogden has reported as stolen has now been given to the creature named Snotspill, who considers it his \"magic banner\", so that you can gain access to the lower levels of the labyrinth.  Complying with the request of a thief is not exactly an honorable thing to do, but you had to do what must be done to continue your quest to investigate the evil underneath the church..."
        }
      ],
      "Name" : "The Missing Tavern Sign",
      "Picture" : 65535,
      "Priority" : 2,
      "Tag" : "QST_OGDENSIGN",
      "XP" : 0
    },
    {
      "Comment" : "",
      "EntryList" : [
        {
          "End" : 0,
          "ID" : 1,
          "Text" : "Pepin tells you of a problem with the town's water supply. It has become brackish and stagnant, and has caused some of the townspeople to become sick when they drink it. The town's water reserves are quickly running out. The healer believes that there may be a secret passage that leads to the spring that serves the town."
        },
        {
          "End" : 0,
          "ID" : 2,
          "Text" : "A doorway in the cathedral leads to a dark passage that leads to the spring that Pepin was talking about. You discover that vile creatures infest the area near the spring.  As the last of the creatures fall, you noticed that the waters have cleared up and lost their murky quality. There is no doubt who the culprits were.  You must report back to Pepin and let him know that Tristram's water supply is clean once again."
        },
        {
          "End" : 1,
          "ID" : 3,
          "Text" : "Pepin believes that the mere presence of the creatures near the spring has caused the water to become tainted. This surely is an unexplainable evil you are dealing with.  But for now, the town's water supply is clean once again."
        }
      ],
      "Name" : "The Poisoned Water Supply",
      "Picture" : 65535,
      "Priority" : 2,
      "Tag" : "QST_WATERSUPPLY",
      "XP" : 0
    },
    {
      "Comment" : "",
      "EntryList" : [
        {
          "End" : 0,
          "ID" : 1,
          "Text" : "A little girl who calls herself Celia has asked for your help - to find her friend Theo, who seems to have been abducted by bugs and dragged into the ground.  Whether or not this Theo is also a spirit playmate or something else is something you would have to consider later - and whether you should try and appease this ghost and find her friend..."
        },
        {
          "End" : 1,
          "ID" : 2,
          "Text" : "\"Theo\" ended up being a furry little doll, which you strangely obtained from one of the demons in the festering nest...  You have given it back to Celia, who is overjoyed and even gives you a decent reward for your trouble.  A peculiar appeasement to calm a restless spirit, but you have seen stranger things before..."
        }
      ],
      "Name" : "The Search for Theo",
      "Picture" : 65535,
      "Priority" : 4,
      "Tag" : "QST_THEODORE",
      "XP" : 0
    },
    {
      "Comment" : "",
      "EntryList" : [
        {
          "End" : 0,
          "ID" : 1,
          "Text" : "Gillian mentions a strange, crimson shimmering light deep within the woods in the last few days, earlier brought to her attention by two young men, Roof and Inneas, who have both disappeared a few days after reporting this sighting.  She thinks that these strange lights have something to do with the sudden disappearance of men in town in the past few days.\n\nInvestigating the forest north of town may give you some answers."
        },
        {
          "End" : 1,
          "ID" : 2,
          "Text" : "You discover the source of the strange lights - it was the evil set forth by Andariel, a demonic temptress bent on consuming the life force of all men she could find.  The lights were used to lure men to her, where she can then do her feeding uncontested.\n\nThis little mystery is now solved, and the men of Tristram (what remained of them, anyway) are now safe from the evil in the forest."
        }
      ],
      "Name" : "The Strange Lights",
      "Picture" : 65535,
      "Priority" : 3,
      "Tag" : "QST_LIGHTS",
      "XP" : 0
    },
    {
      "Comment" : "",
      "EntryList" : [
        {
          "End" : 0,
          "ID" : 1,
          "Text" : "You discover that the troubles that have beset Tristram can all be traced to one person - the Archbishop Lazarus.  It was Lazarus who led the townspeople into that ill-fated rescue for King Leoric's son, Prince Albrecht - who turned out to be kidnapped by the Archbishop himself.\n\nLazarus was last seen going deeper into the labyrinth beneath the Cathedral, abandoning the townsfolk who followed him to be slaughtered by the vile creatures below..."
        },
        {
          "End" : 0,
          "ID" : 2,
          "Text" : "After showing the storyteller a staff you found in Hell, which turned out to be the staff that the Archbishop Lazarus himself used, he reveals his true identity.  The storyteller's name is Deckard Cain, the Elder, and he is the last descendant of an ancient brotherhood that was dedicated to safeguarding the secrets of an evil long ago.  He believes that this evil has now been released.\n\nDeckard Cain recounts the events that prompted the townspeople to follow Lazarus deep into the labyrinth, where they were slaughtered due to his treachery.  He thinks that the kidnapping of the king's son Albrecht by Lazarus may be part of a grand scheme, and that the vile betrayer intends to sacrifice the boy to some dark force.  It is up to you to try and find Lazarus and rescue the boy from certain doom..."
        },
        {
          "End" : 1,
          "ID" : 3,
          "Text" : "The vile betrayer lies dead at your feet, and the souls of those he has betrayed are now avenged.  But you discover that a portal in the Unholy Altar leads to a demonic lair deep within the Burning Hells - where an ancient evil lies in wait.  You should ask Cain about it before going any further..."
        }
      ],
      "Name" : "The Vile Betrayer",
      "Picture" : 65535,
      "Priority" : 1,
      "Tag" : "QST_LAZARUS",
      "XP" : 0
    },
    {
      "Comment" : "",
      "EntryList" : [
        {
          "End" : 0,
          "ID" : 1,
          "Text" : "You find a steel tome in Hell that mentions the Warlord of Blood.  Perhaps you should have Cain have a look at it and tell you what it means..."
        },
        {
          "End" : 0,
          "ID" : 2,
          "Text" : "Cain tells you the story about the Warlord of Blood from the ancient chronicles of the Sin War:\n\n\"Stained by a thousand years of war, blood and death, the Warlord of Blood stands upon a mountain of his tattered victims.  His dark blade screams a black curse to the living; a tortured invitation to any who would stand before this executioner of hell.  It is also written that although he was once a mortal who fought beside the legion of darkness during the Sin War, he lost his humanity to his insatiable hunger for blood.\"\n\nDefeating this dark warrior might lead you closer to finding out the secret behind the darkness that has consumed Tristram..."
        },
        {
          "End" : 1,
          "ID" : 3,
          "Text" : "The Warlord of Blood was a formidable foe, but you have succeeded in defeating the dark warrior.  The Armories of Hell where the Warlord of Blood dwells was not only teeming with demonic creatures, but unimaginable treasures, and deep inside you considered this quest not only a great service to Tristram, but a profitable venture as well..."
        },
        {
          "End" : 1,
          "ID" : 4,
          "Text" : "The Warlord of Blood was a formidable foe, but you have succeeded in defeating the dark warrior.  The Armories of Hell where the Warlord of Blood dwells was not only teeming with demonic creatures, but unimaginable treasures, and deep inside you considered this quest not only a great service to Tristram, but a profitable venture as well..."
        }
      ],
      "Name" : "The Warlord of Blood",
      "Picture" : 65535,
      "Priority" : 2,
      "Tag" : "QST_WARLORD",
      "XP" : 0
    },
    {
      "Comment" : "",
      "EntryList" : [
        {
          "End" : 0,
          "ID" : 1,
          "Text" : "Pepin has frantically asked your help to get rid of monstrous worms that were coming out of the ground!  He said that he saw these creatures inside the house of one of the townsfolk he was tending - the house that is opposite Pepin's.  Even though dealing with vermin under cellars is not worth your attention, with all that's been happening to Tristram, this may be worth investigating."
        },
        {
          "End" : 1,
          "ID" : 2,
          "Text" : "You found out that these \"monstrous worms\" were actually the wriggling young of gigantic ants under the townsfolk's house!  You have succeeded in slaying the Hive Queen, thus preventing more of her foul progeny.  But near the creature's nest, you found a gaping chasm - with the sounds of monstrous insects emanating from it.\n\nMaybe the source of that sound is where these gigantic vermin came from.  You would have to keep your eyes open, in case you would need to enter that seemingly vile place yourself."
        },
        {
          "End" : 1,
          "ID" : 3,
          "Text" : "You finally took the time to go to the house where Pepin mentioned that monstrous worms were coming out of the ground.  However, upon reaching the area beneath the cellar, you discover that you cannot go further - the passage seemed to have been sealed off.  Perhaps these \"worms\" were a part of the Defiler's brood, and defeating the Defiler has also cleansed this area of the vileness of its spawn.\n\nYou just shrug and consider this quest done... maybe if you had gone here earlier, you could have seen what manner of creatures slithered in this place..."
        }
      ],
      "Name" : "The Worms in the Cellar",
      "Picture" : 65535,
      "Priority" : 2,
      "Tag" : "QST_WORMS",
      "XP" : 0
    },
    {
      "Comment" : "",
      "EntryList" : [
        {
          "End" : 0,
          "ID" : 1,
          "Text" : "The elderly sorcerer named T'kron seems very eccentric, but has told you that his reasons for coming to Tristram was to gather enough information about whatever evil it was that has encroached upon the town.  His order, the Vizjerei, is an ancient caste of sorcerers from the East who have taken a strange, intense interest in the recent events unfolding in Tristram.\n\nYou ask why such interest in what is going on, but T'kron says that he will tell you more once he has gotten to know more about you and about the town..."
        },
        {
          "End" : 0,
          "ID" : 2,
          "Text" : "T'kron reveals that the Vizjerei sent him to Tristram because they fear that the events that have been transpiring is a sign of an ancient evil that they have feared will come back and ravage the lands of Sanctuary.  The sorcerer mentions an ancient order of mortal magi named the Horadrim, who were entrusted to defend the world from demons.  The Vizjerei has taken a keen interest in the methods of the Horadrim, and the elders have sent out scribes and scholars all over Sanctuary to gather whatever information they can about the history and ancient ways of battling demons.\n\nT'kron seems to think that Tristram is the epicenter of demonic activity, and wants to gather as much tomes relating to it as possible, so that he can go back to the Vizjerei armed with enough knowledge to prepare for what seems to be the start of another great war between mortals and demons.  He asks that you help him gather the necessary tomes to get his work done."
        },
        {
          "End" : 1,
          "ID" : 3,
          "Text" : "It took a lot of searching, but T'kron has decided that he had gathered enough information from the tomes you have retrieved from the labyrinth to bring back to the Vizjerei.  Despite the amount of knowledge he has learned from the tomes, and his travels with you, he appeared rather distressed as to what it all means.  He does not seem to be optimistic about everything you have discovered, and has warned you to be very careful of the ancient evil you move against.\n\nFor your assistance, he rewards you with a rare amulet that will serve as a useful tool in all your future quests.  He also said that he would postpone his return to the East just to be ready to assist you in case you need his services to battle the demonic entities under the labyrinth.  He said that you would need all the help you can get..."
        }
      ],
      "Name" : "T'kron's Knowledge",
      "Picture" : 65535,
      "Priority" : 3,
      "Tag" : "QST_TKRON",
      "XP" : 0
    },
    {
      "Comment" : "",
      "EntryList" : [
        {
          "End" : 0,
          "ID" : 1,
          "Text" : "Yet another quest given to you by Chuck.  You still don't know what it is supposed to be."
        },
        {
          "End" : 1,
          "ID" : 2,
          "Text" : "The quest given to you by Chuck has been ... well, do you really need to know, anyway?"
        }
      ],
      "Name" : "Yet Another Quest",
      "Picture" : 65535,
      "Priority" : 2,
      "Tag" : "QST_QUEST2",
      "XP" : 0
    },
    {
      "Comment" : "",
      "EntryList" : [
        {
          "End" : 0,
          "ID" : 1,
          "Text" : "The catacombs is a strange place to find a human being, but find him you did, in the form of Zhar, who seems to be engrossed in his study of arcane magic. He asks that you leave him alone. He does not seem right in the head."
        },
        {
          "End" : 1,
          "ID" : 2,
          "Text" : "Not heeding the request of a mad man turned out to be a bad idea. Zhar turned on you in maddened rage... But he is now dead, like everything else in these wretched catacombs... You can almost understand how the man can go insane in this place...."
        }
      ],
      "Name" : "Zhar the Mad",
      "Picture" : 65535,
      "Priority" : 4,
      "Tag" : "QST_ZHAR",
      "XP" : 0
    }
  ]
}